{
    "2025-01-23": [
        {
            "title": "Last 24 Hours to Register to Join the Liwa Desert Trip!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "Don't miss out on one of the most popular trips of the year! The Kashtah program is back, and spots fill up fast.Join us for an unforgettable service-learning experience in the Liwa desert!\"Kashtah\" means a day trip in pleasant weather, and this excursion will immerse you in the UAE’s intangible heritage. You’ll engage with local culture, connect with people, and explore Liwa desert’s unique beauty.Dates: January 25 or 26, 2025Transportation and food are provided.Clickhereto learn more about this desert experience and to register before spots run out!Not a first-year student, but want to chaperone? Contact the Civic Engagement and Service team atnyuad.civic.engagement@nyu.edu.",
            "topic": "Community Outreach",
            "date": "2025-01-23",
            "posted_by": "Shamma Albreiki"
        },
        {
            "title": "TODAY | Panel Discussion with the HRF Winter Writing Retreat Participants",
            "category": "Events & Activities",
            "description": "JAN 23 | 5 PM | Reading Room, A4-008 |RSVP HEREThe Humanities Research Fellowship for the Study of the Arab World invites you to apanel discussionshowcasing the work of our inauguralWinter Writing Retreatparticipants. This event will feature research from eight senior scholars representing institutions in Germany, Austria, the UK, and the US.Spanning fields such as Anthropology, Cultural Studies, History, Literature, and Middle Eastern Studies, their projects delve into innovative dimensions in the study of the Arab world. This panel offers a unique opportunity to engage with cutting-edge Humanities research and connect with global scholars.SpeakersJames Allinson(University of Edinburgh)Sebastian Günther(University of Goettingen)Magdalena Moorthy-Kloss(Leibniz-ZMO / Austrian Academy of Sciences)Mohammed Muharram(University of Bremen)Mona Oraby(Howard University)Vaughn Rasberry(Stanford)Zekeria Ahmed Salem(Northwestern University)Nükhet Varlik(Rutgers University – Newark)",
            "topic": "Research",
            "date": "2025-01-23",
            "posted_by": "Raya Lakova"
        }
    ],
    "2025-01-22": [
        {
            "title": "Interested in Learning from Global Business Leaders?",
            "category": "Events & Activities",
            "description": "Kickstart your Spring semester and join theVP of Marketing & Sector Development at DWTC, CEO of Destek Patent, and CEO of Walther Kranz PR and Media Communications in apanel discussionsharing their experiences and insights on leadership, innovation, and the evolving dynamics of international business.Register here",
            "topic": "Career Development",
            "date": "2025-01-22",
            "posted_by": "Manal Deria"
        },
        {
            "title": "Cultivating Psychological Safety at Work-A Path to Inclusion and Innovation-Thurs at 6pm Online",
            "category": "Events & Activities",
            "description": "TheEngineering IDBEA Committeepresents the first talk this year of it's seminar series, \"Cultivating Psychological Safety at Work-A Path to Inclusion and Innovation\"Date: Thursday January 23, 2025Time: 6pmOnline. Zoom link:https://nyu.zoom.us/j/97779534756Join us for this session with Vandana Juneja, Equity, Diversity & Inclusion Officer at Thornton Tomasetti. Vandana will lead us through a discussion on cultivating psychological safety at work - understanding the meaning of psychological safety, its importance as a business imperative - particularly in a technical environment, pragmatic actions for cultivating a psychologically safe culture on teams and in organizations, and how we can all draw on empathy to supercharge workplace cultures for improved communication, collaboration, and innovation.",
            "topic": "Inclusion, Diversity, Belonging, and Equity",
            "date": "2025-01-22",
            "posted_by": "Amani Magid"
        },
        {
            "title": "Volunteers needed for class photo prep| January 27",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "External Relations and Communications is looking for 20 students to pose for a group photo in order to test some lighting setups. The testing scenario will run for an hour onJanuary 27at10:30amin the performance gym in C2. Participants will receive a meal voucher.Please emailnyuad.photography@nyu.eduif you are interested.Deadline to sign up is 12:00pm on January 23.",
            "topic": "Community Life",
            "date": "2025-01-22",
            "posted_by": "Deepthi Unnikrishnan"
        },
        {
            "title": "Volunteer at Kayan Wellness Festival: The largest wellness festival in the region",
            "category": "Events & Activities",
            "description": "Kayan Wellness Festival is a three-day event set against the scenic backdrop of Al Fahid Island's beaches. The festival is a transformative experience designed to inspire holistic well-being across mind, body, soul, and heartAs a volunteer at the Kayan Wellness Festival, you will (duties vary by role):Ensure the smooth execution of this transformative eventWelcome guests at the entranceAssist with navigation and session support as a Guest LiaisonWork closely with performers and facilitators in zones like The Soul Zone, The Body Zone, and The Heart ZoneGuide talent between green rooms and session spacesAssist with light equipment handlingHelp monitor areas like the Biohacking Pavilion or the Kids HideoutEach role requires excellent communication skills, a positive attitude, and the ability to adapt in a fast-paced environment.For more information and to registerclick here.",
            "topic": "Community Outreach",
            "date": "2025-01-22",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-22",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "Last chance to register for these A&H courses!",
            "category": "News & Information",
            "description": "The Arts and Humanities Division has several courses with a bunch of seats left! Make sure to register on Albert by Monday, January 27 to secure your spot!ANTH-UH 1104 Merchants, Chiefs and SpiritsFILMM-UH 1912Practices of Documentary Filmmaking: Record and RepresentationHIST-UH 1126X Digital HistoryHIST-UH 2123 Women in World HistoryLITCW-UH 1101 Rotten Englishes: Postcolonialism and the Politics of LanguageLITCW-UH 1160X Global Women WritingLITCW-UH 3317 Migrants, Poetics, Narratives of FlightMUSIC-UH 1101 Sonic PracticeMUSIC-UH 3860 Advanced Topics in MusicPHIL-UH 3610 Topics in Practical PhilosophyTHEAT-UH 1010 Making Theater",
            "topic": "Academics",
            "date": "2025-01-22",
            "posted_by": "Layla Alsawan"
        },
        {
            "title": "Calling all Artists and Creatives!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "Interested in a career in the arts? Looking for ways to build your portfolio, CV, and cover letter as an aspiring artist/ arts professional?Sign up for theArts Proxy Program, an 8-week-long professional development program for students interested in a career in the arts. It aims to provide participants a well-rounded introduction to the field, its structure, the skills needed, and alumni’s experiences.﻿Over the course of the program, you will develop and refine your resumes and artistic portfolio; attend hard and soft skill-building workshops (e.g. mock interview, putting together a residency/grant application, budgeting); learn about opportunities available to creatives; connect with artists, curators, and art programmers in the UAE; and complete a creative project of your choice.Start Date: Week of February 10, 2025Expected Hours: 3-5 hours/week, for 8 weeksApplyhere",
            "topic": "Career Development",
            "date": "2025-01-22",
            "posted_by": "Sherin Faisal Alansari"
        },
        {
            "title": "Computer Science & CITIES Seminar",
            "category": "Events & Activities",
            "description": "Computer Science & CITIES SeminarDescription:view in calendarSpeaker:Prof. Peter Haas, UMass Amherst, USATitle:Graph and Generative Neural Networks for Accelerating Simulation-based Decision Making Under UncertaintyHost:CITIES (Azza Abouzied, Associate Professor of Computer Science)Location:C1-045Time:2:15 - 3:15 pmDate:Tuesday, February 11, 2025RSVPhere.",
            "topic": "Academics",
            "date": "2025-01-22",
            "posted_by": "Adela Kovarova"
        }
    ],
    "2025-01-21": [
        {
            "title": "Smoke Free Campus Policy",
            "category": "Policies",
            "description": "NYUAD's Smoke Free Campus Policy has been reviewed and updated. Please read the updated policyhere.",
            "topic": "Environmental Health and Safety",
            "date": "2025-01-21",
            "posted_by": "Meenakshi Gupta"
        },
        {
            "title": "Subjects needed for group photo lighting tests | January 27",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "External Relations and Communications is looking for 20 students to pose for a group photo in order to test some lighting setups. The testing scenario will run for an hour onJanuary 27at10:30amin the performance gym in C2. Participants will receive a meal voucher.Please emailnyuad.photography@nyu.eduif you are interested.Deadline to sign up is 12:00pm on January 23.",
            "topic": "Campus Life",
            "date": "2025-01-21",
            "posted_by": "Deepthi Unnikrishnan"
        },
        {
            "title": "OPEN PHE CLASSES | Enroll Now",
            "category": "Events & Activities",
            "description": "Dear Students,There are still open spots in the following Physical and Health Education (PHE) classes;Introduction to Group Fitness Classes (Tues/Thurs 11:20 am-12:35 pm)Women's Contemporary Dance (Mon/Weds 11:20 am-12:35 pm)Team Sports (Tues/Thurs 4:15 pm-5:30 pm)We encourage you to secure a spot and enroll if you need credit or want to take the course out of interest.",
            "topic": "Athletics",
            "date": "2025-01-21",
            "posted_by": "Hana AlMakkawy"
        },
        {
            "title": "Planned server maintenance outage - Intranet/student portal",
            "category": "Service Notifications",
            "description": "A planned outage has been scheduled due to essential server maintenance. This maintenance is scheduled for Wednesday, January 22, between 6-8pm. During this maintenance window, you may experience intermittent access or temporary unavailability of certain services. We are committed to minimizing this disruption and appreciate your understanding.Affected services:NYUAD community websites:IntranetStudent portalService portalAdministrative tools:Content management system for intranet, student portal and the public website.Admin portalPlease contact us atnyuad.web@nyu.eduif you have any questions or concerns.",
            "topic": "Technology",
            "date": "2025-01-21",
            "posted_by": "Olana Samuel Olana"
        },
        {
            "title": "Cybersecurity Scam of the Week: PayPal Invoice Scam",
            "category": "News & Information",
            "description": "Cybercriminals have developed a new way to exploit PayPal users through phishing scams. A legitimate-looking email from PayPal requests payment and contains a real PayPal link. Despite appearing authentic, this email is part of a malicious trick.The email is sent to your address and an unrecognized one belonging to cybercriminals. Clicking the link in the email links their address to your PayPal account, granting them full access to your account details, credentials, and financial information.Tips to Protect Yourself:Avoid making payments after receiving unexpected emails. Instead, visit the organization’s official website or app to ensure secure payments.Carefully check email recipients. Be cautious of emails sent to unfamiliar addresses.Even trusted domains can be used maliciously. Always verify emails, even if they appear legitimate.Stay vigilant and secure your accounts!",
            "topic": "Technology",
            "date": "2025-01-21",
            "posted_by": "Aman Mudhar"
        },
        {
            "title": "Beytna - Cie Omar Rajeh & Maqamat - Unique dance show - Students free",
            "category": "Events & Activities",
            "description": "NYUAD Students get free tickets with promo code Arts4StudentsBeytna - Cie Omar Rajeh & MaqamatFour dancer/choreographers and four musicians meet onstage over a banquet of food.Presented with the support of Dance Reflections by Van Cleef & ArpelsThursday, Jan 30 @ 7:30pm, The Red TheaterBook your ticket onlinehere",
            "topic": "Events and Activities",
            "date": "2025-01-21",
            "posted_by": "Clive Alan Primrose"
        },
        {
            "title": "Call for Volunteers: Weekday Opportunity at Emirates Park Zoo!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "Looking for a meaningful way to spend your mornings? Calling all students who are interested in zoology, conservation, or wildlife conservation to join us as a volunteer at Emirates Park Zoo!Volunteer to feed, care for animals, collect routine collect data while working alongside zoologist.When: Weekdays (9 AM - 1 PM).Transportation: Provided.What to Expect: Assist in exciting activities, support the zoo team, and make a positive impact!Sign up nowand be part of this wild experience!For questions please email NYUAD Civic Engagement & Service at nyuad.civic.engagement@nyu.edu",
            "topic": "Community Outreach",
            "date": "2025-01-21",
            "posted_by": "Shamma Albreiki"
        }
    ],
    "2025-01-20": [
        {
            "title": "ARC Extended Drop-in Hours",
            "category": "News & Information",
            "description": "Starting Tuesday, January 21 through Friday, January 31, the Academic Resource Center has extended drop-in hours in C2-3101.Extended Hours:Monday - Thursday: 11 AM - 4 PMFriday: 10 AM - 12 PM & 2:30 PM - 4:00 PM",
            "topic": "Academic Resources",
            "date": "2025-01-20",
            "posted_by": "Amna Mohamed Saeed Alfarraj Alketbi"
        },
        {
            "title": "ITC - Transportation Innovation Exhibition 2025",
            "category": "Events & Activities",
            "description": "The Integrated Transport Centre (ITC) is pleased to announce the annual Transportation Innovation Exhibition for 2025, scheduled to take place in February at their Headquarters in the Rabdan Area of Abu Dhabi City. This exhibition will highlight pioneering technologies, innovations, trials, and research papers related to the transport sector or impacting transportation systems.The event will be held from the18th to the 19th of February 2025. Specific timings and additional details will be confirmed at a later stage.We invite NYUAD staff, researchers, professors, or students who may wish to present their work during the exhibition to submit theattached templatetonyuad.cities@nyu.eduby the end of this week.The audience for this event will primarily consist of ITC employees, experts from relevant transport companies' R&D divisions, as well as academic researchers.",
            "topic": "Academics",
            "date": "2025-01-20",
            "posted_by": "Adela Kovarova"
        },
        {
            "title": "BikeShare Program Coming Soon!",
            "category": "Events & Activities",
            "description": "The Student BikeShare program will open for the Spring semester onTuesday, January 28.Please watch for a post on \"Announcements\" on Jan. 28 to link you to the form to request a bike for the weekend. For information on the program, you can find it under our Community Recreation tab of the Student Portal.",
            "topic": "Athletics",
            "date": "2025-01-20",
            "posted_by": "Vicky Davis"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-20",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "MFA Duo SMS issue",
            "category": "Service Notifications",
            "description": "We are currently experiencing an issue with SMS authentication for Duo Multi-Factor Authentication (MFA). Our team is actively working with the vendor to resolve this as soon as possible.In the meantime, we recommend configuringPushauthentication for uninterrupted access. Please visit the IT Support Center in the C2 Campus Center or contact us atx88888for assistance with setting up Push authentication.",
            "topic": "Technology",
            "date": "2025-01-20",
            "posted_by": "Aman Mudhar"
        },
        {
            "title": "NYUAD Guest Wifi",
            "category": "Service Notifications",
            "description": "We are currently experiencing an issue where new users are not receiving SMS messages when signing up for NYUAD Guest Access.If access is required, please contact us atx88888or visit the IT Support Center in the C2 Campus Center to request a username and password",
            "topic": "Technology",
            "date": "2025-01-20",
            "posted_by": "Aman Mudhar"
        },
        {
            "title": "The RealAD Show 2025 Auditions are now open!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "The RealAD Show 2025is back and now open for auditions! This NYUAD tradition is an annual theater production for first-year students - written and performed by upper-class NYU Abu Dhabi students - to present some of the real life student experiences and support available.If you are interested in exploring your talents through dance, music, comedy, and drama,click hereto learn more about how to be a Cast Member. (no formal experience required)Being part of RealAD is a once in a lifetime experience! Please note this is a funded opportunity that will require you to be in New York City this summer for rehearsals. Participants will receive 1-credit for their participation.Deadline for submissions is January 27, 2025.",
            "topic": "Wellness",
            "date": "2025-01-20",
            "posted_by": "Remy Shanker"
        }
    ],
    "2025-01-18": [
        {
            "title": "Indoor Track Closed on Tuesday & Thursday afternoon",
            "category": "Events & Activities",
            "description": "UPDATED January 18The Indoor Track will be closed on Tuesday and Thursday this week from 5:30- 7:30 pm.Sorry for the inconvenience.",
            "topic": "Athletics",
            "date": "2025-01-18",
            "posted_by": "Vicky Davis"
        },
        {
            "title": "Outdoor Track Closures This Week",
            "category": "Events & Activities",
            "description": "UPDATED January 18The Outdoor Track will be closed at the following times this week.Monday, Jan. 20: Closed 4pm- 8pmTuesday, Jan. 21: Closed 4pm- 8pmWednesday, Jan. 22: Closed from 7- 10 pm.Thursday, Jan. 23: Closed 4pm- 8pmSaturday, Jan. 25: Closed 4pm- 8pmSunday, Jan. 26: Closed 4pm- 8pmThere will be no Northsite Parking during these hours.",
            "topic": "Athletics",
            "date": "2025-01-18",
            "posted_by": "Vicky Davis"
        }
    ],
    "2025-01-17": [
        {
            "title": "Aviation Safety Course | Selected Topics in Mechanical Engineering",
            "category": "News & Information",
            "description": "UPDATED January 17ENGR-UH 4760 - Aviation SafetyTuesday & Thursdays3:35 to 6:15 PMJoinMarwa Al Mamari, UAE's first Aerospace Engineer, in exploring the principles that keep the skies safe. This 4-credit course covers key topics like human factors, risk management, safety technologies, and global safety initiatives.You’ll dive into case studies of major aviation accidents, uncovering root causes and lessons learned. Understand the regulatory frameworks that shape global aviation safety, and gain insights into cutting-edge tools and systems keeping aircraft secure.Why choose this course?Engage in hands-on projects and real-world case studies.Learn from guest speakers who are leaders in aviation safety.Gain practical skills to identify and manage risks.Prepare to lead in both aviation safety and related fields.Whether you’re passionate about aerospace, human factors, or safety tech, this course equips you with the knowledge and skills for a successful career.Register now on Albert!",
            "topic": "Academics",
            "date": "2025-01-17",
            "posted_by": "Jacqui Menezes"
        },
        {
            "title": "Important: End of January Term 2025 Departure Shuttle Schedule From Campus to Airport",
            "category": "News & Information",
            "description": "TheEnd of January Term 2025 Departure Shuttles from Campus to Airportis now live on the student portal. Please confirm your flight time and departure terminal from your ticket and ensure you take theshuttle most appropriately timed to your departure. Always allow sufficient time to reach the airport.Students departing Abu Dhabi must leave campus at least 4 hours before their flight.Students departing Dubai must leave campus at least 6 hours before their flight.The shuttles are provided on a first-come, first-served basis and will depart promptly from the Welcome Center, so it is important to be mindful of departure times. If you miss a scheduled shuttle, you must take a taxi to the airport to avoid missing your flight.In case of any issue regarding your shuttle, please contact Nirvana Travel at the following contact details: Tel: +971 2 628 7250 Email:nyuad@ntravel.aeSafe Travels!Student Mobility Team.",
            "topic": "Global Education",
            "date": "2025-01-17",
            "posted_by": "Senthil Ravi"
        },
        {
            "title": "Important: Spring 2025 Arrival shuttle schedule from the Airport to Campus",
            "category": "News & Information",
            "description": "TheSpring 2025 Arrival shuttle schedule from the Airport to Campusis now live on the student portal. Please confirm your specific arrival time from your plane ticket and plan to take the shuttle closest to your arrival time.Once you exit the secured airport area and enter the arrivals lounge, look for the Nirvana Travel Coordinator with NYUAD signage. They will escort you to the vehicle that will transport you to campus. All vehicles will depart promptly from the airport, so it is important to be mindful of departure times.Airport transfers are available on a first-come, first-served basis, with priority given to students whose flights align with the official check-in period. If you miss a scheduled vehicle, you may wait for the next scheduled vehicle (if available) or take your own taxi to campus at your expense. Students arriving outside the arrival window period must arrange their own transportation to campus.In case of any issue regarding your shuttle, please contact Nirvana Travel at the following contact details: Tel: +971 2 628 7250 Email:nyuad@ntravel.aeIf you have any travel-related questions or concerns, please feel free to contact our team atnyuad@studentmobility@nyu.edu.",
            "topic": "Global Education",
            "date": "2025-01-17",
            "posted_by": "Senthil Ravi"
        },
        {
            "title": "Call for Candidate Weekend Volunteers!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "We're looking for students to assist with various hosting/guiding/general help duties during the upcoming Candidate Weekend, February 6-9 . Please fill outthis formto indicate your interest, and the form will close at 5:00pm on Monday, January 27. Everyone who submits the form is expected to attend a mandatory meeting onThursday, January 30 at 6:00pmin the Undergraduate Admissions Office on the 2nd floor of C2 near the Baraha-you will not receive a separate confirmation or invitation to this meeting.",
            "topic": "Admissions",
            "date": "2025-01-17",
            "posted_by": "Hanan Adeeb Abed"
        },
        {
            "title": "Women's Only Gym Closed January 22nd for maintenance (9am-5:30pm)",
            "category": "Service Notifications",
            "description": "Good Evening,Please note that Women's Only Gym will be closed on January 22nd for maintenanceTime: (9am-5:30pm)Thank you",
            "topic": "Athletics",
            "date": "2025-01-17",
            "posted_by": "Yasmin Alremeithi"
        },
        {
            "title": "Spring/Summer Grads: Deadline to finalize major/minor declarations is January 27th",
            "category": "Deadlines",
            "description": "Graduating soon! Congratulations!To ensure that you are on track with degree requirements check your Degree Progress Report (DPR) for declaredmajors and minors.If any changes need to be made, submit adeclarationform no later than the last day of add/drop in the lastsemesteryou plan to graduate.For students graduating in thespring semester or summer/June term, the deadline to update any declarations is thelast day of 14-week add/drop for thespring semester.For students graduating in thefall semester or January term, the deadline to update any declarations is thelast day of 14-week add/drop for thefall semester.If you have any questions about your majors or minors please reach out to your mentor or visit theAcademic Resource Center(nyuad.arc@nyu.edu).Have a great semester at NYU Abu Dhabi!",
            "topic": "Registrar",
            "date": "2025-01-17",
            "posted_by": "Monique Hassan"
        }
    ],
    "2025-01-16": [
        {
            "title": "All are invited to participate in MRI research!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "ASPIRE Precision Medicine Research Institute Abu Dhabi invites you to participate in a MRI study here at NYUAD. The institute’s mission is to gain a better understanding of conditions prevalent in the region.For the first session, we will first collect demographic data and vision tests. Then, we will collect a series of brain scans in the MRI scanner. Finally, we will collect a saliva sample. This will take approximately 2 hours to complete. The second session will consist of a 1 hour OCT scan and VR vision tests. You will be compensated with vouchers worth approximately 180 AED for full participation.You are eligible to participate if you are above 18 years of age, do not have a history of neurological conditions, and are not pregnant at the time of the study. Those with non-removable metal in their body cannot participate.If you are interested please email the researchers below with the subject line “MRI study.”Last names A-M contact Aysha Hamkari:aah698@nyu.eduLast names N-Z contact Dana Alkalali:dna8993@nyu.edu",
            "topic": "Research",
            "date": "2025-01-16",
            "posted_by": "Dana Nayef Omar Mohamed Alkalali"
        },
        {
            "title": "Join Us for Friday Meal Distribution with Emirates Red Crescent!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "We’re thrilled to announce an incredible opportunity to make a meaningful impact by distributing meals to those in need. Join us every Friday morning from 10:00 AM to 1:00 PM in Mussafah, in front of the Emirates Red Crescent Warehouse, as we work together to support our community.Event Details:Location: Mussafah, in front of ERC WarehouseTiming: Fridays, 10:00 AM – 1:00 PM (before Friday prayers)Transportation: Provided for all participantsRegister here!Be a part of this rewarding experience, and let’s make a difference together! For any questions, please reach out to NYUAD Civic Engagement & Service at nyuad.civic.engagement@nyu.edu.Starts on January 24, 2025!",
            "topic": "Community Outreach",
            "date": "2025-01-16",
            "posted_by": "Shamma Albreiki"
        },
        {
            "title": "Exciting Announcement: Rabt Hub Program is Here!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "We’re thrilled to announce the launch ofRabt Hub, an inspiring initiative by NYUAD in collaboration with the Emirates Foundation and the Emirates Council for Rural Development. Rabt Hub aims to empower young women aged 18–35 by enhancing their English language skills for practical, everyday use and personal development.Be part of this impactful journey!As a tutor, you’ll play a key role in helping participants achieve their goals, while gaining valuable experience in mentorship and cross-cultural exchange.Interested in joining? Register now![Registration Link]For any inquiries, please email nyuad.civic.engagement@nyu.edu.Let’s make a difference together!",
            "topic": "Community Outreach",
            "date": "2025-01-16",
            "posted_by": "Shamma Albreiki"
        },
        {
            "title": "Textbook Distribution for Spring 2025",
            "category": "News & Information",
            "description": "Attention all students!Textbook distribution for Spring 2025 will be taking place on Saturday Jan 18-31. The distribution will be held in A6 Building-Bookstore lobby from 9:00am – 5:00pmPlease make sure to bring your ID card and your recent class schedule. This is your chance to get the required textbooks for your courses this semester. Don't miss out!",
            "topic": "Bookstore",
            "date": "2025-01-16",
            "posted_by": "Joselyn Jusayan Ilumin"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-16",
            "posted_by": "Alya Alhammadi"
        }
    ],
    "2025-01-15": [
        {
            "title": "Library Hours update_Spring 2025 (starting Jan 20)",
            "category": "Service Notifications",
            "description": "Monday - Thursday : 8:00 am - 2:00 amFriday : 8:00 am - 10:00 pmSaturday : 10:00 am - 8:00 pmSunday : 10:00 am - 2:00 am",
            "topic": "Library",
            "date": "2025-01-15",
            "posted_by": "Gerardo Reyes Jr."
        },
        {
            "title": "Night Souk",
            "category": "Events & Activities",
            "description": "UPDATED January 16You're invited to experience theNight Soukscheduled on:Night Souk 1: 15 – 17 Jan. 2025 – 4pm – 10pmNight Souk 2: 13 – 14 Feb. 2025 – 4pm – 10pmFrom the East Plaza to John Sexton Square, explore more than 40 retail vendors offering locally made artisanal crafts, jewelry, home décor, pottery, food and many more.Interested parties may reach out to the exhibition company directly via@the_souq_abudhabion Instagram.",
            "topic": "Events and Activities",
            "date": "2025-01-15",
            "posted_by": "Grace Dumancas"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-15",
            "posted_by": "Alya Alhammadi"
        }
    ],
    "2025-01-14": [
        {
            "title": "Newly added Core Courses",
            "category": "News & Information",
            "description": "I am pleased to let you know that two core courses have been added to the Spring 2025 schedule:CADT-UH 1001 Manus et MachinaMatthew Karau -Lecture: M 09:55 - 11:10 Lab: W 09:55 - 12:35This course explores how technology and machines have influenced human life across the ages.This course appears in...Core Curriculum > Arts, Design, and TechnologyMajors > Interactive Media > Media and Design ThinkingMinors > Design > Design ThinkingMinors > Heritage Studies > Heritage Management and Research MethodsCADT-UH 1026 Human ValueWendy Bednarz -TR 11:20 - 12:35This class will deconstruct the historical definition of human value across a variety of cultures, from foragers to contemporary global capitalist society.This course appears in...Core Curriculum > Arts, Design, and TechnologyCore Curriculum > Cultural Exploration and Analysis",
            "topic": "Academics",
            "date": "2025-01-14",
            "posted_by": "Caitlin Newsom"
        },
        {
            "title": "OSHE Policy",
            "category": "Policies",
            "description": "NYUAD's Occupational Safety and Health Policy has been reviewed and updated recently. Please take a moment to view the updated policyhere.",
            "topic": "Environmental Health and Safety",
            "date": "2025-01-14",
            "posted_by": "Meenakshi Gupta"
        },
        {
            "title": "Panel Discussion with the HRF Winter Writing Retreat Participants",
            "category": "Events & Activities",
            "description": "JAN 23 | 5 PM | Reading Room, A4-008 |RSVP HEREThe Humanities Research Fellowship for the Study of the Arab World invites you to apanel discussionshowcasing the work of our inauguralWinter Writing Retreatparticipants. This event will feature research from eight senior scholars representing institutions in Germany, Austria, the UK, and the US.Spanning fields such as Anthropology, Cultural Studies, History, Literature, and Middle Eastern Studies, their projects delve into innovative dimensions in the study of the Arab world. This panel offers a unique opportunity to engage with cutting-edge Humanities research and connect with global scholars.SpeakersJames Allinson(University of Edinburgh)Sebastian Günther(University of Goettingen)Magdalena Moorthy-Kloss(Leibniz-ZMO / Austrian Academy of Sciences)Mohammed Muharram(University of Bremen)Mona Oraby(Howard University)Vaughn Rasberry(Stanford)Zekeria Ahmed Salem(Northwestern University)Nükhet Varlik(Rutgers University – Newark)",
            "topic": "Research",
            "date": "2025-01-14",
            "posted_by": "Raya Lakova"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-14",
            "posted_by": "Alya Alhammadi"
        }
    ],
    "2025-01-13": [
        {
            "title": "Join us for Ultimate Frisbee!",
            "category": "Events & Activities",
            "description": "Join us on the Practice Pitch every Friday from 7:30 till 9PM for our weekly Ultimate Frisbee pickup games at NYUAD! This fun, co-ed, no-contact sport is perfect for all experience levels and fitness abilities. Whether you're a seasoned player or a complete beginner, everyone is welcome to join in, make new friends, and enjoy the Abu Dhabi winter. Come give it a try and discover your love for Ultimate Frisbee!",
            "topic": "Athletics",
            "date": "2025-01-13",
            "posted_by": "Khalifa Alsuwaidi"
        },
        {
            "title": "AI for Good Hackathon at NYUAD Slush'D 2025",
            "category": "Events & Activities",
            "description": "Overview:Join theAI for Good Hackathonat NYUAD Slush'D 2025, in collaboration with Nokia, to develop AI-driven solutions enhancing daily life.Theme:AI for Good: Envisioning the Future with NokiaPrizes:Winners receive exclusive prizes, a tour of Nokia HQ, and meetings with senior executives.Team Size:Up to 5 members.Rounds:Round 1:Online hackathon focusing on ideation and prototyping.Dates:January 31 – February 2, 2025Round 2:Top 8 teams pitch live at NYUAD Slush'D 2025.Date:February 8, 2025Eligibility:Open to students from all academic backgrounds; no extensive technical experience required.Registration Deadline:January 26, 2025, 11:59 PMRegister here:Let's build solutions that make a difference!",
            "topic": "Career Development",
            "date": "2025-01-13",
            "posted_by": "Nabeel Mohammed"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-13",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "Graduating in Spring? Check your DPR now",
            "category": "News & Information",
            "description": "UPDATED January 13Please check your online Degree Progress Report (DPR) in Albert to ensure all requirements are either \"Satisfied\" or \"In-progress\" as this is the system used to confirm yourgraduation eligibility. If any items show as \"Not Satisfied\" it means action is required to resolve an issue.If you have any questions or concerns, or if adjustments to your DPR are needed, your major-mentor or theAcademic Resource Center(ARC) in the Library may be able to provide guidance and/or submit requests.Note: Adjustments toward Core Requirements must be submitted by the Core Curriculum (nyuad.core@nyu.edu)YourGraduation Statusalso appears near the top of your DPR – if it still shows “Applied for Graduation” that means we have not yet verified your degree audit/review so you should plan to check back on that later.Separate communications will go out to Summer expected grads later in the academic year.",
            "topic": "Registrar",
            "date": "2025-01-13",
            "posted_by": "Monique Hassan"
        },
        {
            "title": "Diploma Information for Fall 2024 and January 2025",
            "category": "News & Information",
            "description": "UPDATED January 13When will I receive my diploma?For more detailed information regarding graduation and diplomas, please visit theNYUAD Graduation, Diplomas, and Commencementinfo page:https://students.nyuad.nyu.edu/academics/registration/graduation-requirements/graduation-diplomas-and-commencement/Physical diplomas are expected to be ready for distribution mid-March.CeDiplomas will be ordered approximately Feb 15th, and are usually available within 2 weeks.!Diplomas cannot be released if any diploma hold exists on your student records, please check Albert to resolve these ahead of time.Official transcripts requested after degrees are conferred in Albert will show degrees awarded along with the Fall/Jan conferral date (January 27, 2025) and degree GPA. For undergraduates, degree GPA does NOT include first year grades.",
            "topic": "Registrar",
            "date": "2025-01-13",
            "posted_by": "Monique Hassan"
        }
    ],
    "2025-01-10": [
        {
            "title": "Bookstore Booksigning - From Rags to Riches",
            "category": "Events & Activities",
            "description": "Join us for an exciting book signing event featuringMohammed Al Fahim, the author of the inspiring bookFrom Rags to Riches: A Story of Abu DhabiEvent Details:Date:January 30, 2025Time:4:30 PM - 5:30 PMLocation:A6 Room 007 / Lecture HallDon’t miss the opportunity to meet the author, learn more about his incredible journey, and get your copy ofFrom Rags to Richessigned!Spaces are limited, so be sure to register your interesthereWe look forward to seeing you there!",
            "topic": "Bookstore",
            "date": "2025-01-10",
            "posted_by": "Joselyn Jusayan Ilumin"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-10",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "Panel Discussion with HRF Winter Writing Retreat Participants",
            "category": "Events & Activities",
            "description": "JAN 23 | 5 PM | Reading Room, A4-008 |RSVP HEREThe Humanities Research Fellowship for the Study of the Arab World invites you to apanel discussionshowcasing the work of our inauguralWinter Writing Retreatparticipants. This event will feature research from eight senior scholars representing institutions in Germany, Austria, the UK, and the US.Spanning fields such as Anthropology, Cultural Studies, History, Literature, and Middle Eastern Studies, their projects delve into innovative dimensions in the study of the Arab world. This panel offers a unique opportunity to engage with cutting-edge Humanities research and connect with global scholars.SpeakersJames Allinson(University of Edinburgh)Zekeria Denna(Northwestern University)Sebastian Günther(University of Goettingen)Magdalena Moorthy-Kloss(Leibniz-ZMO / Austrian Academy of Sciences)Mohammed Muharram(University of Bremen)Mona Oraby(Howard University)Vaughn Rasberry II(Stanford)Nükhet Varlik(Rutgers University – Newark)",
            "topic": "Research",
            "date": "2025-01-10",
            "posted_by": "Raya Lakova"
        }
    ],
    "2025-01-09": [
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-09",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "Spring 2025 Registration Information",
            "category": "Deadlines",
            "description": "Reminder: Spring 2025 class start onTuesday, January 21- finalize your schedule today!Didn't complete a prerequisite course in time for the spring semester? Update your schedule so you have the correct courses!Update your edit/swaps and waitlists so you don't get switched into a course you may no longer need.The last day to add/drop first seven-week courses isMonday, January 27 by 4:00pm. Please keep in mind that some classes are restricted from being added during the second week of the semester - so don't wait! Get your year started off right be completing your schedule changes today! The add/drop deadline at Global Sites may have a different deadline - if you are studying away this semester, please keep in mind that other campuses can have different deadlines.If you have any questions about course planning and your major requirements reach out to the ARC (nyuad.arc@nyu.edu) and/or your mentor.All academic deadlines can be foundhere.Have a wonderful spring semester at NYUAD!",
            "topic": "Registrar",
            "date": "2025-01-09",
            "posted_by": "Paul Revere"
        }
    ],
    "2025-01-08": [
        {
            "title": "Panel Discussion with HRF Winter Writing Retreat Participants",
            "category": "Events & Activities",
            "description": "JAN 23 | 5 PM | Reading Room, A4-008 |RSVP HEREThe Humanities Research Fellowship for the Study of the Arab World invites you to apanel discussionshowcasing the work of our inauguralWinter Writing Retreatparticipants. This event will feature research from eight senior scholars representing institutions in Germany, Austria, the UK, and the US.Spanning fields such as Anthropology, Cultural Studies, History, Literature, and Middle Eastern Studies, their projects delve into innovative dimensions in the study of the Arab world. This panel offers a unique opportunity to engage with cutting-edge Humanities research and connect with global scholars.SpeakersJames Allinson(University of Edinburgh)Zekeria Denna(Northwestern University)Sebastian Günther(University of Goettingen)Magdalena Moorthy-Kloss(Leibniz-ZMO / Austrian Academy of Sciences)Mohammed Muharram(University of Bremen)Mona Oraby(Howard University)Vaughn Rasberry II(Stanford)Nükhet Varlik(Rutgers University – Newark)",
            "topic": "Research",
            "date": "2025-01-08",
            "posted_by": "Raya Lakova"
        },
        {
            "title": "Become an NYUAD Social Media Ambassador",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "Are you passionate about sharing your NYUAD experience? Join the Social Media Ambassador Program and become a representative of NYUAD on the main NYUAD channels!Apply Now",
            "topic": "Career Development",
            "date": "2025-01-08",
            "posted_by": "Noura Al Makhmari"
        },
        {
            "title": "The Zayed Award for Human Fraternity Week",
            "category": "Events & Activities",
            "description": "The Zayed Award for Human Fraternity Week is looking for volunteers to support their event by welcoming and guiding guests such as prominent international figures and global leaders, and contribute to enriching understanding of the UAE's leading role in promoting the values of human fraternity and peace around the worldFor more information and to registerclick here.About the Zayed Award for Human FraternityThe Zayed Award for Human Fraternity is an annual independent global award that recognizes, supports and honors people and entities of all backgrounds working to advance the timeless values of solidarity, integrity, fairness and optimism.",
            "topic": "Community Outreach",
            "date": "2025-01-08",
            "posted_by": "Alya Alhammadi"
        },
        {
            "title": "UAE Plant and Environment Society Seminars (UPES)",
            "category": "Events & Activities",
            "description": "UAE Plant and Environment Society Seminars (UPES)Speaker Name: Professor Ali Al-Keblawy, University of SharjahTitle: Using UAE Native Plants for Sustainable Landscapes, Desert Restoration, and Green InnovationsHost: UAE Plant and Environment Society (UPES)Location: Zoom (link)Time: 4 pm- 5 pm (UAE time)Date: Wednesday, January 22nd, 2025Abstract: This seminar highlights the potential of native plants in achieving sustainable cityscapes, rehabilitating degraded deserts, and advancing agriculture in arid regions of the UAE. Key topics include the use of native plants in sustainable landscaping of the cities, the role ofMoringa peregrinain biodiesel production and urban landscaping,Citrullus colocynthisas a desert-adapted crop for biodiesel and pharmaceutical production, andCyperus conglomeratusfor oil production and sand dune stabilization. The discussion will showcase how these species contribute to environmental sustainability, economic development, and ecosystem restoration, offering innovative solutions for arid land management.Please sign uphereto receive updates about UPES events.",
            "topic": "Research",
            "date": "2025-01-08",
            "posted_by": "Susan Havlis"
        }
    ],
    "2025-01-06": [
        {
            "title": "PHRC: UAE HEALTHY FUTURE STUDY. JOIN US",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "Are you an Emirati above 18 years old ?The UAE Healthy Future study is the first prospective study to provide scientific evidence of the causes of chronic diseases in the United Arab Emirates. The study also plays an important role in the development of prevention methods for the benefit of the UAE and Arab societies.This study will help us find out:Why obesity, diabetes, and heart disease common in the UAE?What are the most important causes of these diseases?What is the relative importance of our genes, lifestyle (including diet, physical activity, and tobacco use) and the environment?What can we do to prevent them?BOOK YOUR APPOINTMENT NOWhttps://uaehealthyfuture.timetap.com/#/JOIN USWellness Center C2, W014 & W015",
            "topic": "Communications",
            "date": "2025-01-06",
            "posted_by": "Khaloud Al Remeithi"
        },
        {
            "title": "You are invited to participate in MRI research!",
            "category": "Job Opportunities, Internships & Volunteering",
            "description": "ASPIRE Precision Medicine Research Institute Abu Dhabi invites you to participate in a MRI study here at NYUAD. The institute’s mission is to gain a better understanding of conditions prevalent in the region.We will first collect demographic data and vision tests. Then, we will collect a series of brain scans in the MRI scanner. Finally, we will collect a saliva sample. The study will take approximately 2 hours to complete. You will be compensated with vouchers worth approximately 120 AED for participation.You are eligible to participate if you are above 18 years of age, do not have a history of neurological conditions, and are not pregnant at the time of the study. Those with non-removable metal in their body cannot participate.If you are interested please email the researchers below with the subject line “MRI study.”Last names A-M contact Aysha Hamkari:aah698@nyu.eduLast names N-Z contact Dana Alkalali:dna8993@nyu.edu",
            "topic": "Research",
            "date": "2025-01-06",
            "posted_by": "Dana Nayef Omar Mohamed Alkalali"
        },
        {
            "title": "CGSB XIII Symposium February 19-21, 2025",
            "category": "Events & Activities",
            "description": "Get the word out!The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.Submit your poster abstract by January 6, 2025, for a chance to win the Best Poster Award!",
            "topic": "Research",
            "date": "2025-01-06",
            "posted_by": "Susan Havlis"
        }
    ],
    "2025-01-03": [
        {
            "title": "CGSB XIII Symposium February 19-21, 2025",
            "category": "Events & Activities",
            "description": "Get the word out!The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.Submit your poster abstract by January 6, 2025, for a chance to win the Best Poster Award!",
            "topic": "Research",
            "date": "2025-01-03",
            "posted_by": "Susan Havlis"
        }
    ],
    "2025-01-02": [
        {
            "title": "CGSB XIII Symposium February 19-21, 2025",
            "category": "Events & Activities",
            "description": "Get the word out!The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.Submit your poster abstract by January 6, 2025, for a chance to win the Best Poster Award!",
            "topic": "Research",
            "date": "2025-01-02",
            "posted_by": "Susan Havlis"
        }
    ]
}