[
    {
        "title": "Scheduled Emergency IT Network Maintenance – February 14th",
        "category": "Service Notifications",
        "description": "Please be advised that emergency IT network maintenance is scheduled forFriday, February 14th, from 10 PM to Saturday, February 15th, at 4 AM. The following services will be impacted:• NYU WiFi• eduroam• NYUGuest WiFi• LANDuring this period, you may experience intermittent connectivity issues with the above services. However,residential Wi-Fi serviceswill remain unaffected.If you have any questions or concerns, please contact IT support at x88888 or emailnyuad.it@nyu.edu.",
        "topic": "Technology",
        "date": "2025-02-14",
        "posted_by": "Aman Mudhar"
    },
    {
        "title": "100 Days to Commencement",
        "category": "Events & Activities",
        "description": "Hey Seniors!The countdown is on, and we’re celebrating a major milestone! Join us for100 Days to Commencement—your special Class Year Experience event, marking exactly 100 days until graduation!When:Monday, February 17, 2025Time:5:00 PM - 7:00 PMWhere:C2 Plaza (John Sexton's Square)Come out to hang with friends, capture some unforgettable photos, reflect on your journey, and enjoy fun activities we’ve got lined up just for YOU!We can’t wait to celebrate this huge moment with you! Let’s make these last 100 days count!",
        "topic": "Campus Life",
        "date": "2025-02-14",
        "posted_by": "Al Reem Al Hosani"
    },
    {
        "title": "Commencement Eligibility",
        "category": "Policies",
        "description": "Students who are not eligible to walk at commencement this year due to theCommencement Eligibility Policymay request an exception to the policy via thislink.The deadline for commencement petitions isFebruary 22, 2025.Requests received after that date cannot be approved.",
        "topic": "Academics",
        "date": "2025-02-14",
        "posted_by": "Amna Alketbi"
    },
    {
        "title": "Summer research information session on February 17 and 21 at 4PM",
        "category": "News & Information",
        "description": "Students should review thesummer research grantsandsummer research assistant student portal pagefor information.Important update for summer research in the US: The university willnotbe able to process new visa applications, including issuing new I-20s for existing F-1 visa holders for summer 2025. Only I-20 extensions will be possible. As a result,only the following studentswill be eligible for University sponsored US visas:CPT eligible students: Students who are on the 2024 Global Studies Track OR students who will have spent the past year (Fall 2024 & Spring 2025) in the US.Students who are spending the Spring 2025 Semester in any US based NYU Campus.Sign up hereto join one of the information sessions held on February 11, February 17, and February 21 at 4 PM.",
        "topic": "Academics",
        "date": "2025-02-14",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "Saturday! Arts Production Power-Up Workshops",
        "category": "Events & Activities",
        "description": "⚡️Arts Production Power-Up⚡️Saturday, February 15, 10:00 AM - 6:00 PMJoin us tomorrow in the Arts Center for one or all of these workshops. The series is targeted toward students working on installation-based projects and performances and will include training sessions on basic safety, hanging curtains, cable management, projector installation, lighting rigging, and sound setup. The same content will be offered on both dates, so students can choose one to attend or attend certain tech subjects on one date and other subjects on the other date. The Production Power-Up workshops are open to any NYUAD community members.10:00-10:30 AM Basic Production Safety10:40-11:15 AM Hanging Curtains & Cable Management11:30-1:00 PM Basic Projector Installation2:30-4:00 PM Basic Lighting Rigging4:30-6:00 PM Basic Sound SetupMore info and registration here:https://forms.gle/icaGtpc9B4jpmdJX9",
        "topic": "Events and Activities",
        "date": "2025-02-14",
        "posted_by": "Bridin Cotton"
    },
    {
        "title": "Filming Session in Market Place – Monday, Feb 17th",
        "category": "News & Information",
        "description": "Please be advised that there will be afilming session in the Market Place on Monday, February 17th, from 7:30 AM to 12:30 PM. During this time, the area must remain free of noise.To avoid disruption, all outlets in the area remain closed until after 12:30 PM.Thank you for your cooperation and understanding.",
        "topic": "Dining",
        "date": "2025-02-14",
        "posted_by": "Joselyn Jusayan Ilumin"
    },
    {
        "title": "Noon Lockers Now On Campus",
        "category": "News & Information",
        "description": "Noon lockers have been installed on campus and are available for use by NYUAD and surrounding residential communities.The lockers allow you to self-collect secured packages 24/7 through a unique PIN. Please note packages not picked up after five days will be returned to Noon.See Noon lockers location and additional information.",
        "topic": "Campus Life",
        "date": "2025-02-14",
        "posted_by": "Abigail Kelly"
    },
    {
        "title": "COMMENCEMENT VIDEO: Walk-in Location Updates",
        "category": "Events & Activities",
        "description": "Dear Class of 2025,This is an update about February 19, the third day of the Commencement 2025 video filming that is dedicated to walk-ins. Interviews will be conducted on a first-come-first-served basis. Prior reservation is not possible.These are the locations for the day:9am - 12pm: Print Studio ( C3 - 41)2-6pm: Blue Hall C3You will be received by Noura Al Makhmari from the External Relations and Communications team who will help you get registered and checked in. Mario Sioco, our producer, will give you further instructions and conduct the interview.Please:Prepare (but do not memorize) responses for the following:\"Dear Class of 2025 / Dear NYU Abu Dhabi...\"(A short message to your peers or NYU Abu Dhabi)How have you changed since your first year at NYUAD?What was your most memorable experience as a student?\"I will never forget...\"Optional: What advice would you give to incoming students?Keep your responses short but make it personal and meaningful.Please wear something comfortable; avoid anything with stripes, vivid patterns or large branding.If you have not signed your media release form, or if you are not sure,please do so herebefore arriving at the shoot. We require your consent in order to record and publish your video.Please email nyuad.video@nyu.edu if you have any questions.Note: We will do our best to accommodate as many students as we can within these hours. All video interviews will be edited for brevity, and not all content will be included in the final edit.",
        "topic": "Alerts",
        "date": "2025-02-14",
        "posted_by": "Noura Al Makhmari"
    },
    {
        "title": "Annual Graduate Student Research Workshop | Feb 24-26, 2025",
        "category": "Events & Activities",
        "description": "The Humanities Research Fellowship for the Study of the Arab World is pleased to announce the fourth Annual Graduate Student Research Workshop under the theme “New Directions in the Study of the Arab World”. The workshop includes thirteen doctoral students from a variety of disciplines and a range of institutions paired with NYUAD faculty who will serve as discussants for each session.The event will take placeFebruary 24-26, 2025at theReading Room (A4-008)and is convened by Erin Pettigrew (NYUAD) and Nathalie Peutz (NYUAD). It is co-sponsored by the division of Arts & Humanities and the Arab Crossroads Studies program.More information can be foundhere.",
        "topic": "Research",
        "date": "2025-02-14",
        "posted_by": "Raya Lakova"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.",
        "topic": "Research",
        "date": "2025-02-14",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Museum of Imagination Seeking Support",
        "category": "Events & Activities",
        "description": "Volunteer to support the Museum of Imagination event.The Museum of Imagination, organized by the Future Rehabilitation Centre will showcase performances by students with special needs, including those with intellectual disabilities, autism, or multiple disabilities.Date: 20th February 2025Location: Sorbonne UniversityTime: 4:30 PMYour responsibilities as a volunteer will be:Greeting and assisting guestsHelping with registration and seatingDistributing programs and materialsManaging lines and directing guestsEnsuring safety and orderHandling special requests or issuesProviding post-event assistanceFor more information and to sign upclick here.",
        "topic": "Community Outreach",
        "date": "2025-02-13",
        "posted_by": "Alya Alhammadi"
    },
    {
        "title": "Cool Food Pledge & Intentional Eating: Making Sustainable Food Choices",
        "category": "Events & Activities",
        "description": "Join our one-hour interactive workshop on Cool Food Pledge Awareness and Intentional Eating. Learn how your food choices affect both your well-being and the environment, and discover practical ways to adopt mindful, sustainable eating habits.Thursday, Feb 20, at 10:00-11:00amRegistration linkhereThis session is being held as a part ofWell-Being Weekat NYUAD.",
        "topic": "Events and Activities",
        "date": "2025-02-13",
        "posted_by": "Moza Al Nuaimi"
    },
    {
        "title": "ATTENTION ALL FIRST- AND SECOND-YEAR STUDENTS | NYU Tulsa Information Session with the NYU Office of Global Programs",
        "category": "Events & Activities",
        "description": "Please join representatives from the NYU Office of Global ProgramsMarianne R Petit,Associate Vice Chancellor for Global Network Academic Planning,andJanet Alperstein,Assistant Vice President,for an informationsession on the exciting study abroad opportunities at the newest NYU global site in Tulsa, Oklahoma.Time: Monday, February 17, 2025 | 5-6pmLocation: C2-E048",
        "topic": "Global Education",
        "date": "2025-02-13",
        "posted_by": "Momchil Dikov"
    },
    {
        "title": "ATTENTION ALL FIRST- AND SECOND-YEAR STUDENTS | Study Away Information Session with the NYU Office of Global Programs",
        "category": "Events & Activities",
        "description": "Please join representatives from the NYU Office of Global ProgramsMarianne R Petit,Associate Vice Chancellor for Global Network Academic Planning,andJanet Alperstein,Assistant Vice President,for an information session highlighting the rich study abroad opportunities at the NYU global sites.Time: Monday, February 17, 2025 | 4-5pmLocation: C2-E048",
        "topic": "Global Education",
        "date": "2025-02-13",
        "posted_by": "Momchil Dikov"
    },
    {
        "title": "ChemDraw Cloud Users - Major changes from 1st March 2025",
        "category": "Service Notifications",
        "description": "UPDATED February 13All ChemDraw Cloud users should be aware of a major change to the NYU licence from1st January 2025.\"Signals Notebook Individual Edition and ChemDraw Cloud (both of which NYU Libraries previously licensed and distributed through 31 Dec 2024) will experience \"End of Life\" on March 1st, 2025.After March 1st, 2025, access to these accounts and data stored within the platform will no longer be available. All data will be deleted and unrecoverable. \"Please see the NYU Libraries siteherefor important migration information.",
        "topic": "Library",
        "date": "2025-02-13",
        "posted_by": "Jason Clynes"
    },
    {
        "title": "Pest Treatment - D2 Dining Hall - Friday - 14",
        "category": "News & Information",
        "description": "Dear All,We would like to inform you that, as part of our mandatory preventive measures we will be conducting aPest treatment in Campus East Restaurant (D2) on Friday, 14th February 2025.All our dining services including the delivery services will close by 9 pm and we will resume all our services the following day as per regular dining operating hours.",
        "topic": "Dining",
        "date": "2025-02-13",
        "posted_by": "Joselyn Jusayan Ilumin"
    },
    {
        "title": "Open Call for Singers and Musicians!",
        "category": "Events & Activities",
        "description": "Open Call for Singers and Musicians!I'm El'isha Allen, an NYUAD Music Major looking for volunteer performers for my final capstone presentation, a performance in the latter half of April. We will be performing my original music compositions arranged for voice and instruments. I am looking for singers (sopranos, altos, tenors, and basses) and musicians (cello, violin, viola, or other instruments).Timeline:The time commitment would be roughly 2 to 3 rehearsals (between April 8th-21st evening times or weekends depending on volunteer’s availability) and 1 to 2 performances (possibly on weekday evening and one weekend evening (tentatively week of April 14th or April 21st).Questions/Contact:If you are interested in volunteering (and for more information), you can reach me via email (era8351@nyu.edu) or by cell (056 534 7341).Thank you in advance!",
        "topic": "Events and Activities",
        "date": "2025-02-13",
        "posted_by": "Abby Diez"
    },
    {
        "title": "From Me to We: Moving from Territorialism to Collaboration | Hiwar حوار Series",
        "category": "Events & Activities",
        "description": "Discover how to transform competition into cooperation in our workshop, From Me to We: Moving from Territorialism to Collaboration.This interactive session will explore strategies for breaking down silos, fostering trust, and building a culture of shared goals and mutual respect. It will include practical techniques to expand participant’s ability to relate to others in a spirit of togetherness and collaboration to foster inclusion and belonging. Open to everyone.Date:February 25, 2025Time: 12:00-1:30pmLocation: C3-146Clickhereto register. Limited seats available.",
        "topic": "Inclusion, Diversity, Belonging, and Equity",
        "date": "2025-02-13",
        "posted_by": "Sondos Eatamadi"
    },
    {
        "title": "Annual Graduate Student Research Workshop | Feb 24-26, 2025",
        "category": "Events & Activities",
        "description": "The Humanities Research Fellowship for the Study of the Arab World is pleased to announce the fourth Annual Graduate Student Research Workshop under the theme “New Directions in the Study of the Arab World”. The workshop includes thirteen doctoral students from a variety of disciplines and a range of institutions paired with NYUAD faculty who will serve as discussants for each session.The event will take placeFebruary 24-26, 2025at theReading Room (A4-008)and is convened by Erin Pettigrew (NYUAD) and Nathalie Peutz (NYUAD). It is co-sponsored by the division of Arts & Humanities and the Arab Crossroads Studies program.More information can be foundhere.",
        "topic": "Research",
        "date": "2025-02-13",
        "posted_by": "Raya Lakova"
    },
    {
        "title": "Philosophy Colloquium: \"A Bundle View of Perceptual Object Representations\"",
        "category": "Events & Activities",
        "description": "WHO:Alfredo Vernazzani(University of Southampton)WHAT:Philosophy Colloquium: \"A Bundle View of Perceptual Object Representations\" (abstract)WHERE: A2 (Computational Research) 003WHEN:Friday 14 February, 9:30–11:00amWHY: Now you're doing philosophy!Refreshments will be served.The colloquium is open to all NYUAD faculty, students, and staff.",
        "topic": "Academics",
        "date": "2025-02-12",
        "posted_by": "Matthew Silverstein"
    },
    {
        "title": "Calling Creative Volunteers: Collaborate with Arts Capstone Students!",
        "category": "Events & Activities",
        "description": "Interested in getting involved with a creative project this spring?Join us for Arts Capstone Pitch Night – learn more about how you can get involved in the exciting projects that Arts Practice Capstone students are developing to present in the A&H Capstone Festival this year. Whether you're interested in installations, design, film, acting, front-of-house management, backstage support, marketing and communications, producing or other creative areas, this event is a great opportunity to find a project that matches your skills and interests.Capstone Pitch Night will take place on Friday, February 21, 2025, from 5:00 to 7:00 PMin the Arts Center Lobby and is open to all NYUAD students regardless of year or major. NYUAD. community members are also welcome.If you’d like to participate as a creative volunteer,pleaseregister here as an attendee.If you are anArts Capstone Student looking for collaborators?Register as a participant hereQuestions?nyuad.artsproductionassistants@nyu.edu",
        "topic": "Events and Activities",
        "date": "2025-02-12",
        "posted_by": "Abby Diez"
    },
    {
        "title": "Museum of Imagination Seeking Support",
        "category": "Events & Activities",
        "description": "Volunteer to support the Museum of Imagination event.The Museum of Imagination, organized by the Future Rehabilitation Centre will showcase performances by students with special needs, including those with intellectual disabilities, autism, or multiple disabilities.Date: 20th February 2025Location: Sorbonne UniversityTime: 4:30 PMYour responsibilities as a volunteer will be:Greeting and assisting guestsHelping with registration and seatingDistributing programs and materialsManaging lines and directing guestsEnsuring safety and orderHandling special requests or issuesProviding post-event assistanceFor more information and to sign upclick here.",
        "topic": "Community Outreach",
        "date": "2025-02-12",
        "posted_by": "Alya Alhammadi"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.",
        "topic": "Research",
        "date": "2025-02-12",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Become a Rabt Hub Mentor and Make a Difference",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "Rabt Hub connects mentors with young women in rural UAE (Masfut) forbi-weekly virtual English sessions. Through peer-to-peer learning, you’ll help build their confidence, language skills, and future opportunities.No teaching experience is needed—just a passion for guiding others in conversational English, job applications, and digital literacy while embracing cultural exchange.Apply Now!",
        "topic": "Community Outreach",
        "date": "2025-02-11",
        "posted_by": "Shamma Albreiki"
    },
    {
        "title": "AI and Academic Research (virtual)",
        "category": "Learning & Development",
        "description": "Explore the growing world of AI in the context of academic research. We'll talk about using and evaluating AI tools, and ethical and transparent use of AI tools.Attendees will find this workshop useful if they already have basic working knowledge of an AI tool such as ChatGpt.Date:Thursday, February 13, 2025Time:2:00 PM - 3:00 PMRegister here",
        "topic": "Library",
        "date": "2025-02-11",
        "posted_by": "Grace Oluwaseyi Itiola"
    },
    {
        "title": "Health & Safety Performer Recognition Program is finally here!",
        "category": "News & Information",
        "description": "Due to the remarkable success of last year's Safety Performer Recognition Awards, EHS is excited to announce the Health & Safety Performer RecognitionProgram.Please take a few minutes to review the recognition categories and the nomination processhere.EHS welcomes the Campus Community to nominate deserving individuals, teams, and leaders through thisnomination form.Winners will be announced during this year's World Day for Safety and Health Celebration on Apr 17.",
        "topic": "Environmental Health and Safety",
        "date": "2025-02-11",
        "posted_by": "Meenakshi Gupta"
    },
    {
        "title": "Reminder: Summer research information session today at 4 PM!",
        "category": "News & Information",
        "description": "Students should review thesummer research grantsandsummer research assistant student portal pagefor further information.Sign up hereto join one of the information sessions held on February 11, February 17, and February 21 at 4 PM.",
        "topic": "Academics",
        "date": "2025-02-11",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "Gully Cricket this Weekend!",
        "category": "Events & Activities",
        "description": "Play in the premier cricket tradition of NYUAD by signing up as an individual or a teamhere.This edition of Gully Cricket promises unparalleled levels of fun, food, and cricket. Join us to crown the Champions of this Spring's biggest cricket event! All skill levels welcome!Join as a team or as an individual. Sign up to play by tomorrow!",
        "topic": "Events and Activities",
        "date": "2025-02-11",
        "posted_by": "Farzan Khan"
    },
    {
        "title": "Cybersecurity scam of the week: Amazon Prime Phishing",
        "category": "News & Information",
        "description": "Cybercriminals are exploiting Amazon Prime memberships by sending fake renewal emails. These emails contain a link to a PDF file, which then redirects to a fraudulent Amazon login page. The page looks genuine but is designed to steal login credentials, credit card details, and personal information.How to Stay Protected:Avoid opening unexpected attachments or clicking links in suspicious emails.Check your Amazon Prime status by visiting the official website or mobile app directly.Be cautious of emails creating urgency or requesting sensitive information. When in doubt, contact Amazon through their official customer support.Stay alert and protect your personal and financial information!",
        "topic": "Technology",
        "date": "2025-02-11",
        "posted_by": "Wafaa Osman"
    },
    {
        "title": "EMS Account Access Issues",
        "category": "Service Notifications",
        "description": "We recognize that some users are facing technical difficulties when trying to access their EMS accounts. Our technical team is currently working to resolve these issues and restore full functionality as soon as possible.If you have any questions or need immediate assistance, please feel free to contact our Space Reservation Team atnyuad.spacereservation@nyu.edu.We appreciate your patience and understanding during this time. Thank you for your cooperation.Space Reservation Team",
        "topic": "NYUAD Services",
        "date": "2025-02-11",
        "posted_by": "Mary Rose Cuizon"
    },
    {
        "title": "Where is Your Data Going?",
        "category": "Events & Activities",
        "description": "Screening of the film \"Secrets In your Data\" (2024) followed by a brief discussion.Description:Whether you’re on social media or surfing the web, you’re probably sharing more personal data than you realize. Find out where your data is going, who’s selling it, and how you--and a new kind of web--could put control back in your hands.Details and register here",
        "topic": "Library",
        "date": "2025-02-11",
        "posted_by": "Grace Oluwaseyi Itiola"
    },
    {
        "title": "Center for Brain and Health (CBH) Seminar Series | Dr Brian Murphy",
        "category": "Events & Activities",
        "description": "Title of the Event:Understanding Symptoms and Mechanisms of Brain Aging and Mental Health at ScaleSpeaker:Dr. Brian Murphy- Chief Scientific Officer, Founder, Cumulus NeuroscienceDay/Date:Tuesday,February 18, 2025Time:2 PM – 3:15 PMVenue:A2 - First Floor - Room 127Abstract:When assessing neurology and psychiatry patients in clinical care and research, we often choose between advanced tools found in specialist clinics or scalable, imprecise tools. Ideally, we’d track symptoms and mechanisms with more fidelity, but real-world settings like homes and small clinics pose challenges. Brian will discuss the strengths and limitations of assessment tools, from self-report questionnaires to clinic-based neuroimaging, and how repeated sampling, large datasets, and machine learning can help. Brian will illustrate this with data from home-based Alzheimer’s Disease studies and clinical trials. Early findings from international dementia screening studies will also be presented.",
        "topic": "Research",
        "date": "2025-02-11",
        "posted_by": "Baraka Binishaq"
    },
    {
        "title": "The Scholars Lunch Program is Back",
        "category": "Events & Activities",
        "description": "The Office of Undergraduate Education is excited to announce that the Scholars Lunch Program is back, andsign-ups are now open!This is a great opportunity to connect with faculty and peers over lunch, engage in meaningful conversations, and expand your academic network.Don’t miss out—secure your spot today!",
        "topic": "Events and Activities",
        "date": "2025-02-11",
        "posted_by": "Kholoud Al Shamsi"
    },
    {
        "title": "Museum of Imagination Seeking Support",
        "category": "Events & Activities",
        "description": "Volunteer to support the Museum of Imagination event.The Museum of Imagination, organized by the Future Rehabilitation Centre will showcase performances by students with special needs, including those with intellectual disabilities, autism, or multiple disabilities.Date:20th February 2025Location:Sorbonne UniversityTime:4:30 PMYour responsibilities as a volunteer will be:Greeting and assisting guestsHelping with registration and seatingDistributing programs and materialsManaging lines and directing guestsEnsuring safety and orderHandling special requests or issuesProviding post-event assistanceFor more information and to sign upclick here.",
        "topic": "Community Outreach",
        "date": "2025-02-11",
        "posted_by": "Alya Alhammadi"
    },
    {
        "title": "Al Barza Event Night - February 19",
        "category": "Events & Activities",
        "description": "Al Barza,a unique opportunity for students to engage withErich Dietrich, Vice Provost of Undergraduate Education, in a relaxed and informal setting is set to host a special Charades showdown!Get ready for an evening of laughter, quick thinking, and fierce competition as you Students get a chance to take on theOffice of Undergraduate Educationteam.Bring your game face, come to cheer for your team, and let’s make it a match to remember!Sign up here",
        "topic": "Events and Activities",
        "date": "2025-02-11",
        "posted_by": "Kholoud Al Shamsi"
    },
    {
        "title": "Annual Graduate Student Research Workshop | Feb 24-26, 2025",
        "category": "Events & Activities",
        "description": "The Humanities Research Fellowship for the Study of the Arab World is pleased to announce the fourth Annual Graduate Student Research Workshop under the theme “New Directions in the Study of the Arab World”. The workshop includes thirteen doctoral students from a variety of disciplines and a range of institutions paired with NYUAD faculty who will serve as discussants for each session.The event will take placeFebruary 24-26, 2025at theReading Room (A4-008)and is convened by Erin Pettigrew (NYUAD) and Nathalie Peutz (NYUAD). It is co-sponsored by the division of Arts & Humanities and the Arab Crossroads Studies program.More information can be foundhere.",
        "topic": "Research",
        "date": "2025-02-11",
        "posted_by": "Raya Lakova"
    },
    {
        "title": "Spanish Film Series: \"No se aceptan devoluciones\"",
        "category": "Events & Activities",
        "description": "Join us for the second movie in theSpanish Film Seriesthis semester. We will be screening \"No se aceptan devoluciones\", one of the most successful Mexican films ever, on Thursday, Feb 20th, at 7:30pm in the Arts Center Screening Room.View trailer athttps://youtu.be/Ua5qcs7RHiY?si=YytuKnb97TSjjzw6",
        "topic": "Events and Activities",
        "date": "2025-02-11",
        "posted_by": "Eduardo LageOtero"
    },
    {
        "title": "From Me to We: Moving from Territorialism to Collaboration | Hiwar حوار Series",
        "category": "Events & Activities",
        "description": "Discover how to transform competition into cooperation in our workshop, From Me to We: Moving from Territorialism to Collaboration.This interactive session will explore strategies for breaking down silos, fostering trust, and building a culture of shared goals and mutual respect. It will include practical techniques to expand participant’s ability to relate to others in a spirit of togetherness and collaboration to foster inclusion and belonging. Open to everyone.Date:February 25, 2025Time: 12:00-1:30pmLocation: C3-146Clickhereto register. Limited seats available.",
        "topic": "Inclusion, Diversity, Belonging, and Equity",
        "date": "2025-02-11",
        "posted_by": "Sondos Eatamadi"
    },
    {
        "title": "Off-Campus Trip to Al Serkal Avenue [Sunday, February 16 at 2:30pm]",
        "category": "Events & Activities",
        "description": "Dean's Outreach Program - Off-Campus Trip to KAVE in Al Serkal AvenueStudent Affairs will be organizing a shuttle for students onSunday, February 16to Al Serkal Avenue from2:30pm(departure from campus) to7:30pm(departure from Al Serkal Avenue).Several events take place at Al Serkal avenue over the weekend including an informal open mic event at the cafe:https://thestoryofthings.com/event/kaves-sunday-open-mic-mashup-27/Please use this form to signup by Wednesday, Feb 12:https://forms.gle/jjMfRW1BH2zNtkNF6Your registration will be confirmed via email. For questions, feel free to contact: nyuad.studentlife@nyu.edu.",
        "topic": "Campus Life",
        "date": "2025-02-10",
        "posted_by": "Sara Pervaiz Amjad"
    },
    {
        "title": "The Bookstore Grand Warehouse Sale of the Year!",
        "category": "Discounts, Deals & Promotions",
        "description": "Get ready for incredible deals at theBookstore Warehouse SalehappeningFebruary 21-23atSexton Squarefrom10 AM - 6 PM.WithMORE books, toys, and itemson sale than ever before, this is the perfect opportunity to grab your favorites at unbeatable prices!Don’t miss out—mark your calendar and we’ll see you there!",
        "topic": "Bookstore",
        "date": "2025-02-10",
        "posted_by": "Joselyn Jusayan Ilumin"
    },
    {
        "title": "TODAY: Summer Registration Begins!",
        "category": "News & Information",
        "description": "Course registration for Summer 4-week courses in Abu Dhabi will begin today at 6pm. Registration priority is as follows:Monday, Feb 10 (today) @ 6pm -Seniors(Graduating Summer 2026 or sooner)Tuesday, Feb 11 @ 5pm -Students who have not taken a Summercourse beforeWednesday, Feb 12 @ 5pm -Everyone elseStudents are limited to taking 1 class and may not take a June Term and Summer Term class at the same time. A limited number of PHE classes will be available for the Summer, but only for students already enrolled in a Summer course--so please register for your for-credit course before attempting to register in a PHE course.Students will have a placeholder class in their schedule until their registration window opens. This course will be dropped for you, but may cause a validation error beforehand.More Summer Term information can be found here.",
        "topic": "Registrar",
        "date": "2025-02-10",
        "posted_by": "Lee Zerrilla"
    },
    {
        "title": "Play Cricket this Weekend!",
        "category": "Events & Activities",
        "description": "Play in the premier cricket tradition of NYUAD by signing up as an individual or a teamhere.This edition of Gully Cricket promises unparalleled levels of fun, food, and cricket. Join us to crown the Champions of this Spring's biggest cricket event! All skill levels welcome!Join as a team or as an individual. Sign up to play by February 11!",
        "topic": "Events and Activities",
        "date": "2025-02-10",
        "posted_by": "Farzan Khan"
    },
    {
        "title": "Night Souk",
        "category": "Events & Activities",
        "description": "You're invited to experience theNight Soukscheduled on:Night Souk 1: 13 – 14 February 2025 – 4pm – 10pmNight Souk 2: 15 February 2025 – 11am – 8pmFrom the East Plaza to John Sexton Square, explore more than 40 retail vendors offering locally made artisanal crafts, jewelry, home décor, pottery, food and many more.Night Souq also features:New York Pizzeria – [On all dates]Specialty Coffee & Bakery by Mysk [14th Feb.]Arabic Street Food by Royal Catering [15th Feb.]Interested parties may reach out to the exhibition company directly via@the_souq_abudhabion Instagram.",
        "topic": "Events and Activities",
        "date": "2025-02-10",
        "posted_by": "Grace Dumancas"
    },
    {
        "title": "Dinner with Strangers: Cultivating Community | Hiwar حوار Series | Well-being Week",
        "category": "Events & Activities",
        "description": "Dinner with Strangers is a collaboration between the Staff Council, the Hiwar series, and Well-being Week.Taking place at local restaurants, this immersive experience draws inspiration from the communal joy of sharing a meal, designed to weave the fabric of our diverse community tighter through the simple yet profound act of dining together. Open to all staff, faculty, post docs, and researchers.Date: February 20, 2025Time: 6:00-8:00pmLocation: Vietnamese PhoClickhereto register. Limited seats available.",
        "topic": "Inclusion, Diversity, Belonging, and Equity",
        "date": "2025-02-10",
        "posted_by": "Sondos Eatamadi"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-02-10",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Museum of Imagination Seeking Support",
        "category": "Events & Activities",
        "description": "Volunteer to support the Museum of Imagination event.The Museum of Imagination, organized by the Future Rehabilitation Centre will showcase performances by students with special needs, including those with intellectual disabilities, autism, or multiple disabilities.Date:20th February 2025Location:Sorbonne UniversityTime:4:30 PMYour responsibilities as a volunteer will be:Greeting and assisting guestsHelping with registration and seatingDistributing programs and materialsManaging lines and directing guestsEnsuring safety and orderHandling special requests or issuesProviding post-event assistanceFor more information and to sign upclick here.",
        "topic": "Community Outreach",
        "date": "2025-02-07",
        "posted_by": "Alya Alhammadi"
    },
    {
        "title": "You're Invited to Love Data Week!",
        "category": "Learning & Development",
        "description": "Welcome to Love Data Week!Join us in the NYUAD Library fromFebruary 10-14, 2025, to learn about data equity and inclusion, disciplinary communities, and creating a kinder world through data!Workshops will also take placethrough the end of February.At the Library as well as online we'll be hosting workshops and events that cover topics related to finding and interacting with data, data privacy, and data in the age of AI, keeping in theme with\"Who's Data Is It, Anyway?\"Workshops include:Introduction to Secondary DataCapital IQ: Powerful Tools for Industry and Data ResearchPersonal Data in the Age of AIMake Zotero Work For YouSecrets in Your Data...and a few more! You cansign up for them here.",
        "topic": "Library",
        "date": "2025-02-07",
        "posted_by": "Grace Oluwaseyi Itiola"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-02-07",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Cybersecurity scam of the week: Wildfire Relief Scams",
        "category": "News & Information",
        "description": "Following recent wildfires in California, cybercriminals are exploiting disaster victims by impersonating federal officers and offering fake relief aid. These scams are spreading through emails, phone calls, and even in-person visits.Scammers claim financial aid is available but demand upfront fees and request personal information like Social Security numbers. Victims who comply lose money and risk identity theft, with no actual aid in return.Tips to Protect Yourself:Avoid paying fees for disaster relief.Verify information on official government websites before taking action.Be cautious of unsolicited messages or visits offering financial aid, especially if they request personal details.Stay alert and protect against disaster-related scams!",
        "topic": "Technology",
        "date": "2025-02-06",
        "posted_by": "Aman Mudhar"
    },
    {
        "title": "Sign Up for Sustained Dialogue!",
        "category": "Events & Activities",
        "description": "Sustained Dialogueis an initiative designed to create a “brave space” where participants can engage with both our differences and similarities, fostering a deeper understanding of one another and our community. Through this process, students will practice empathy, resilience, and open-mindedness while exploring a range of sensitive topics in a cohort of their peers.We offer 6-8 facilitated sessions at various times throughout the week. Sign-up slots are limited, and spaces will be held on a first-come, first-served basis. Participants are expected to attend all sessions, starting with the opening session through to the closing session. Please note that only those who have signed up in advance will be allowed to attendDinner will be provided at each sessionRSVPHERE",
        "topic": "Intercultural Affairs",
        "date": "2025-02-06",
        "posted_by": "Sara Omar"
    },
    {
        "title": "Global Awards info meetings",
        "category": "Learning & Development",
        "description": "Introduction to Global Awards: February 11, 6:30pm. Global Awards are national or international-level merit-based awards. Join us to learn more about the awards and how to apply.Rhodes and Gates Cambridge: February 13, 7:00pm. Rhodes provides for two years of graduate study at Oxford. Gates Cambridge provides funding for graduate study at Cambridge.Schwarzman and Yenching: February 17, 5:00pm. Schwarzman is an MA in Global Affairs at Tsinghua University. Yenching Academy provides funding for an MA in Chinese Studies at Peking University.Knight-Hennessy and McCall MacBain: February 19, 7:00pm. Knight-Hennessy provides three years of funding for graduate study at Stanford. McCall MacBain provides funding for an MA or professional degree at McGill.Erasmus Mundus and Fulbright: February 24, 5:00pm. Erasmus Mundus is a group of ~125 European MA programs, many of which include full funding. Fulbright provides funding for graduate-level study in the US.",
        "topic": "Academic Resources",
        "date": "2025-02-06",
        "posted_by": "Doug Cutchins"
    },
    {
        "title": "Post-graduation Practical Training Program (PPTP) | Deadlines: March 5 and April 10",
        "category": "Events & Activities",
        "description": "The Post-graduation Practical Training Program (PPTP) allows faculty to appoint graduating NYUAD students to work on short-term research projects during the summer following their graduation. The program is designed to provide participants with intensive training and professional development experience to strengthen the skills needed for successful application and transition to graduate school or the workforce.The deadline for submission of the appointment form by faculty is March 5, 2025 (priority deadline) and April 10, 2025.Students should review thePPTPstudent portal pagefor further information.",
        "topic": "Academics",
        "date": "2025-02-06",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "Summer Research Assistant Program | Deadlines: March 5, April 10 and May 5",
        "category": "Events & Activities",
        "description": "The Summer Research Assistant Program provides NYUAD faculty the opportunity to appoint NYUAD students during the summer to work on tasks to advance faculty research projects. These paid positions must have specific schedules and deliverables. Research assistants should not be paid to work on their Capstone projects.The deadline for faculty to submit the hiring request form is as follows:March 5, 2025 (on-campus and remote positions)April 10, 2025 (on-campus and remote positions)May 5, 2025 (remote positions only)Students should review thesummer research assistant student portal pagefor further information.Sign up hereto join one of the information sessions held on February 11, February 17, and February 21 at 4 pm.",
        "topic": "Academics",
        "date": "2025-02-06",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "Summer Research Grants | Deadlines: March 10 and April 7",
        "category": "News & Information",
        "description": "NYUAD undergraduate and graduate students enrolled in the MFA program may apply for competitive summer research grantsif they have secured full-time internal or external summer research positions.Application Cycle 1 Deadline:March 10, 10 am GST. Students who require university-sponsored US visa support (I-20 extension) or UAE student visa renewal must apply by this deadline.Application Cycle 2 Deadline:April 7, 10 am GST.Students who do not need any visa support from the university may apply in either Cycle 1 or Cycle 2.Please review theSummer Research Grant pageon the Student Portal carefully for more information on eligibility and selection criteria, housing, visa, and legal requirements, and FAQs.Sign up hereto join one of the information sessions held on February 11, February 17, and February 21 at 4 pm.",
        "topic": "Academics",
        "date": "2025-02-06",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "Join the Al Barza Event Night - February 19th!",
        "category": "Events & Activities",
        "description": "Al Barza, a unique opportunity for students to engage withErich Dietrich, Vice Provost of Undergraduate Education, in a relaxed and informal setting is set to host a special Charades showdown!Get ready for an evening of laughter, quick thinking, and fierce competition as you Students get a chance to take on the OUE team.Bring your game face, come to cheer for your team, and let’s make it a match to remember!Sign up here.",
        "topic": "Academics",
        "date": "2025-02-05",
        "posted_by": "Ithka Laws-Gabrovec"
    },
    {
        "title": "Hult Prize at NYUAD",
        "category": "Events & Activities",
        "description": "Submission Deadline: February 15 | Local Competition: February 28The Hult Prize is back at NYUAD, challenging you to transform ideas into global solutions! In 2012, an NYUAD teamwonthe competition and securedUSD one millionto launch their startup—now it’s your turn!!This year’s theme empowers you to tackle pressing social issues through innovation and entrepreneurship. Create a four minute pitch, compete with students worldwide, and get a shot at the grand prize! Sign up now and be part of NYUAD’s legacy!If you have further questions, please contactdhyey.vank@nyu.edu.Click here to register.",
        "topic": "Events and Activities",
        "date": "2025-02-05",
        "posted_by": "Kholoud Al Shamsi"
    },
    {
        "title": "The Scholars Lunch Program is Back – Sign Up Now!",
        "category": "Events & Activities",
        "description": "The Office of Undergraduate Education isexcited to announce that theScholars Lunch Programis back, andsign-ups are now open!This is a great opportunity to connect with faculty and peers over lunch, engage in meaningful conversations, and expand your academic network.Don’t miss out—secure your spot today!",
        "topic": "Academics",
        "date": "2025-02-05",
        "posted_by": "Ithka Laws-Gabrovec"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-02-05",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "February Library Workshops",
        "category": "Events & Activities",
        "description": "The Library is excited to share its workshops calendar for February! This month, we'll be holding workshops on AI and Academic Research, an AI STEM salon, Zotero, Researching Islam and more.Click here for full details.",
        "topic": "Library",
        "date": "2025-02-04",
        "posted_by": "Grace Oluwaseyi Itiola"
    },
    {
        "title": "Mysk's 2nd Anniversary – 50% discount",
        "category": "Discounts, Deals & Promotions",
        "description": "On February 6th, 2025, Mysk will celebrate its 2nd anniversary since opening. Enjoy a50% discounton bakery items and coffee.You can also customize your ownbento cakefor the 14th!",
        "topic": "Dining",
        "date": "2025-02-04",
        "posted_by": "Shamma Alhosani"
    },
    {
        "title": "Extended deadline: House of Artisans Design Competition",
        "category": "Events & Activities",
        "description": "The inaugural House of Artisans Design Competition is now open for submissions! The competition aims to celebrate the rich heritage of traditional Emirati craft and the artisans behind them, working hand in hand to merge and reconnect the past with the present through design pieces that pay homage to intricate craftsmanship while pushing the boundaries of contemporary design. Aspiring artists, creatives, and designers are encouraged to submit their design proposals for products or furniture. Selected participants will embark on a concept development journey, bringing their designs to life through expert fabrication support. NEW deadline for submissions: March 9, 2025. Visitwww.hoadesigncompetition.aeor follow @houseofartisans.ae on Instagram for more details about the competition.NYUAD will host an exclusive info session about the competition on February 6, 2025, at 5 PM in the Visual Design Lab (C3-112). Emailekm294@nyu.edufor more information.",
        "topic": "Around Abu Dhabi",
        "date": "2025-02-04",
        "posted_by": "Erin Collins"
    },
    {
        "title": "Participate in brain imaging research!",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "ASPIRE Precision Medicine Research Institute Abu Dhabi invites you to participate in a MRI study here at NYUAD! The institute’s mission is to gain a better understanding of conditions prevalent in the region.For the first session, we will first collect demographic data and vision tests. Then, we will collect a series of brain scans in the MRI scanner. Finally, we will collect a saliva sample. The study will take approximately 2 hours to complete. The second session will consist of a 1 hour OCT scan and virtual reality vision tests. You will be compensated with vouchers worth 180 AED.You are eligible to participate if you are above 18 years of age, do not have a history of neurological conditions, are not pregnant at the time of the study, and do not have non-removable metal.If you are interested please email one of the researchers below:Last names A-M contact Aysha Hamkari:aah698@nyu.eduLast names N-Z contact Dana Alkalali:dna8993@nyu.edu",
        "topic": "Research",
        "date": "2025-02-03",
        "posted_by": "Dana Nayef Omar Mohamed Alkalali"
    },
    {
        "title": "Exciting Book Signing Event: Meet Adil Alzarooni!",
        "category": "Events & Activities",
        "description": "Join us for an exclusive book signing event with renowned authorAdil Alzaroonito celebrate the release of his latest work,The Red Island!Date: February 20, 2024Time: 4:30pm -5:30pmLocation: Bookstore A6-Bldg.This is your chance to meet Adil Alzarooni in person, get your copy ofThe Red Islandsigned, and delve into the fascinating world of his latest novel. Don’t miss out on this opportunity to engage with the author and hear firsthand about the inspiration behind this captivating story.We look forward to seeing you there! Register your interesthere",
        "topic": "Bookstore",
        "date": "2025-02-03",
        "posted_by": "Joselyn Jusayan Ilumin"
    },
    {
        "title": "Spring 2025 class registration deadline today at 4:00pm for 14-week courses",
        "category": "Deadlines",
        "description": "Reminder! The last day to add/drop 14-week courses isMonday, February 3 by4:00pmso the waitlist engine can finalize any remaining requests.It can take time for aDROPto be processed in the system during peak enrollment times. Withdraw from 14-week courses will be updated to a drop but can take time (up to an hour) before enrollment in a replacement class can take place.\"W\" grades will be updated to a drop if the request is submitted before the deadline.Please keep in mind some classes are restricted from being added during the second week of the semester - so plan a backup if needed!Finalize your schedule (validate your selections!) and update anywaitlistsandedit swapsso your schedule does not have any unexpected changes!If you have any questions about course planning and your major requirements reach out to the ARC (nyuad.arc@nyu.edu) and/or your mentor.All academic deadlines can be foundhere.Have a wonderful spring semester at NYUAD!",
        "topic": "Registrar",
        "date": "2025-02-03",
        "posted_by": "Paul Revere"
    },
    {
        "title": "Have You Noticed the New QR Code Stickers on the Printers?",
        "category": "News & Information",
        "description": "Scan them and explore theCITIES Dashboard Printingproject while you wait for your pages to be printed. Explore historical printing statistics dating back toSeptember 2018, as well as comparing the number of pages used by our community before and after the introduction of thesoft cap. Together, we can lower their printing needs through a knowledge-is-empowerment approach.Link to the project:https://citiesdashboard.com/project/printing",
        "topic": "Campus Life",
        "date": "2025-02-03",
        "posted_by": "Vinh Thanh Nguyen"
    },
    {
        "title": "Study Away Course Alternate Proposals - Enrollment Deadline Today!",
        "category": "News & Information",
        "description": "UPDATED February 3Today is the Spring add/drop deadline for 14-week courses!If you submitted a proposal that is pending a final decision, please be sure to have your backup enrollment plan in placebefore 4pm(UAE time) if the course is/was not approved as proposed or a decision is not made before the end of add/drop.Although every effort is made to review courses timely, the review process can take several weeks. You will be notified by email when a decision is made.Proposals should be submitted at least three weeks before the start ofregistrationto allow time for schedule adjustments and/or further proposals.Course alternates are reviewed and updated regularly. Please check frequently as you plan your study away.",
        "topic": "Registrar",
        "date": "2025-02-03",
        "posted_by": "Monique Hassan"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-02-03",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Spring 2025 Class Registration Information",
        "category": "Deadlines",
        "description": "Reminder! The last day to add/drop 14-week courses isMonday, February 3 by4:00pmso the waitlist engine can finalize any remaining requests.It can take time for aDROPto be processed in the system during peak enrollment times. Withdraw from 14-week courses will be updated to a drop but can take time (up to an hour) before enrollment in a replacement class can take place.Please keep in mind some classes are restricted from being added during the second week of the semester - so plan a backup if needed!Finalize your schedule and update anywaitlistsandedit swapsso your schedule does not have any unexpected changes!Make sure to finalize any schedule changesbeforethe deadline. If you have any questions about course planning and your major requirements reach out to the ARC (nyuad.arc@nyu.edu) and/or your mentor.All academic deadlines can be foundhere.Have a wonderful spring semester at NYUAD!",
        "topic": "Registrar",
        "date": "2025-02-02",
        "posted_by": "Paul Revere"
    },
    {
        "title": "Looking to Explore Careers in Marketing, Branding, and Digital Communications?",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "Don’t miss the upcomingemployer session with ICON MarComm GrouponWednesday, February 5, from 5:00 to 7:00 PM!Registeron HandshakeAbout ICON MarComm GroupICON MarComm Group is a360° integrated marketing, branding, and digital communications agencyspecializing in high-end, data-driven advertising campaigns, brand strategies, and storytelling.Learn how brands navigate today’soversaturated digital landscapeusing intelligent design and behavioral insights.Discover the power ofvisual storytelling, motion brand experiences, and dynamic brand integrationto foster authentic engagement.Gain insights intohow brands can move beyond traditional marketingto create meaningful two-way conversations with consumers.Network withindustry professionalsand explore career opportunities in this evolving field.",
        "topic": "Career Development",
        "date": "2025-01-31",
        "posted_by": "Sherin Faisal Alansari"
    },
    {
        "title": "Focused Writing Space is Back! Sundays, 7:30-9:30pm",
        "category": "News & Information",
        "description": "Semester already in full swing? Got lots of work to do, but lacking focus? Need some friendly and/or stern faces to help you get work done? COFFEE?!Join us for weekly Focused Writing Space this Sunday (Feb. 2) and every Sunday in the Center for Writing from 7:30-9:30pm!You bring the work, we'll bring the writing (and moral) support and the coffee!Write & Focus. Here.",
        "topic": "Academics",
        "date": "2025-01-30",
        "posted_by": "Samia Ahmed"
    },
    {
        "title": "Spring 2025 course registration deadline",
        "category": "Deadlines",
        "description": "Reminder! The last day to add/drop 14-week courses isMonday, February 3 by4:00pmso the waitlist engine can finalize any remaining requests. Please keep in mind some classes are restricted from being added during the second week of the semester - so plan a backup if needed!Finalize your schedule and update anywaitlistsandedit swapsso your schedule does not have any unexpected changes! The add/drop deadline at Global Sites may have a different deadline - if you are studying away this semester, please keep in mind that other campuses can have different deadlines.Make sure to finalize any schedule changesbeforethe deadline. If you have any questions about course planning and your major requirements reach out to the ARC (nyuad.arc@nyu.edu) and/or your mentor.All academic deadlines can be foundhere.Have a wonderful spring semester at NYUAD!",
        "topic": "Registrar",
        "date": "2025-01-30",
        "posted_by": "Paul Revere"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-01-30",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "The Center for Writing Opens Tomorrow - Wednesday, Jan. 29!",
        "category": "News & Information",
        "description": "The Center for Writing will open for the spring semester tomorrow, Wednesday, Jan. 29th!Book an appointment atnyuad.mywconline.comor drop by to meet with a writing consultant.As a reminder, you can come in with anything (or nothing), school-related or not. We're here to help, no matter where you are in the process!Write. Here.",
        "topic": "Academics",
        "date": "2025-01-28",
        "posted_by": "Samia Ahmed"
    },
    {
        "title": "Fire Drills",
        "category": "News & Information",
        "description": "Campus fire drills will be conducted from February 3 to February 10. Upon hearing the alarm, please evacuate the building, follow the instructions of the fire wardens and Campus Safety Officers and proceed to the designated assembly point. For more information, please refer to NYUAD'sEmergency Action Plan.",
        "topic": "Environmental Health and Safety",
        "date": "2025-01-28",
        "posted_by": "Khaldoun Mohamed"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-01-28",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Recruiting Participants for EEG Study on Face Perception",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "Eligibility:Aged between 18 - 45No neuro/visual impairmentsIdentify as Black or WhiteWhy take part?Progress ScienceSee your brainwaves!Compensation (AED 55/hr cash)How to participate?To participate, please complete the following briefscreening questionnaire.Note: Please use yourNYU Net IDas the unique identifier.We will be using a DRY EEG system,No Gel No Mess.If you have any questions or complaints about the questionnaire or its outcomes, please contact Yared Getachew (yg1980@nyu.edu), Jen Lewendon (jal9590@nyu.edu), or Anne Maass (anne.maass@nyu.edu).",
        "topic": "Research",
        "date": "2025-01-27",
        "posted_by": "Anne Maass"
    },
    {
        "title": "Spring 2025 add/drop deadline approaching!",
        "category": "Deadlines",
        "description": "We hope your spring 2025 semester has had a great start! The last day to add/drop 14-week courses isMonday, February 3 by 4:00pm so the waitlist engine can finalize remaining requests. Please keep in mind some classes are restricted from being added during the second week of the semester - so plan a backup if needed! Finalize your schedule and update anywaitlistsandedit swapsso your schedule does not have any unexpected changes! The add/drop deadline at Global Sites may have a different deadline - if you are studying away this semester, please keep in mind that other campuses can have different deadlines.Make sure to finalize any schedule changesbeforethe deadline. If you have any questions about course planning and your major requirements reach out to the ARC (nyuad.arc@nyu.edu) and/or your mentor.All academic deadlines can be foundhere.Have a wonderful spring semester at NYUAD!",
        "topic": "Registrar",
        "date": "2025-01-26",
        "posted_by": "Paul Revere"
    },
    {
        "title": "Language Matters Speaker Series on Translanguaging",
        "category": "Events & Activities",
        "description": "Join us for the first webinar this semester on language pedagogy on Monday, Feb. 24, at 5pm via Zoom.\"Beyond Boundaries: Pedagogical Translanguaging and the Transformation of Language Learning\" by Dr. Mihi Park, NUS SingaporeMany language classrooms have become vibrant spaces of linguistic diversity, presenting opportunities and challenges to traditional language instruction. Recognising this potential, language instructors are reimagining course design through the lens of pedagogical translanguaging. In this webinar, I will share a compelling narrative of how translanguaging can create meaningful bridges between existing and new knowledge. This approach encourages students to view language not as a rigid system, but as a fluid, interconnected resource.Register at https://bit.ly/nyuad-lmss",
        "topic": "Academics",
        "date": "2025-01-24",
        "posted_by": "Eduardo LageOtero"
    },
    {
        "title": "Tandon Summer Research Program",
        "category": "News & Information",
        "description": "Excited about hands-on research? The NYU Tandon Undergraduate Summer Research Program (UGSRP) is your chance to dive into 10 weeks of cutting-edge research with world-class faculty! The program is open to NYUAD students studying at any NYU US-based site for spring 2025.Key Dates:2025 Program Dates: June 2 – August 8, 2025Application Deadline: Sunday, February 9, 2025 (11:59 PM EST)How to Apply:Explore the 2025 Project List and submit your application through theUGSRP Online Application Portal!",
        "topic": "Academics",
        "date": "2025-01-24",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-01-24",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Want to participate in brain research?",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "ASPIRE Precision Medicine Research Institute Abu Dhabi invites you to participate in a MRI study here at NYUAD! The institute’s mission is to gain a better understanding of conditions prevalent in the region.For the first session, we will first collect demographic data and vision tests. Then, we will collect a series of brain scans in the MRI scanner. Finally, we will collect a saliva sample. The study will take approximately 2 hours to complete. The second session will consist of a 1 hour OCT scan and virtual reality vision tests. You will be compensated with vouchers worth 180 AED.You are eligible to participate if you are above 18 years of age, do not have a history of neurological conditions, are not pregnant at the time of the study, and do not have non-removable metal.If you are interested please email the researchers below with the subject line “MRI study.”Last names A-M contact Aysha Hamkari:aah698@nyu.eduLast names N-Z contact Dana Alkalali:dna8993@nyu.edu",
        "topic": "Research",
        "date": "2025-01-24",
        "posted_by": "Dana Nayef Omar Mohamed Alkalali"
    },
    {
        "title": "Smoke Free Campus Policy",
        "category": "Policies",
        "description": "NYUAD's Smoke Free Campus Policy has been reviewed and updated. Please read the updated policyhere.",
        "topic": "Environmental Health and Safety",
        "date": "2025-01-21",
        "posted_by": "Meenakshi Gupta"
    },
    {
        "title": "Call for Volunteers: Weekday Opportunity at Emirates Park Zoo!",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "Looking for a meaningful way to spend your mornings? Calling all students who are interested in zoology, conservation, or wildlife conservation to join us as a volunteer at Emirates Park Zoo!Volunteer to feed, care for animals, collect routine collect data while working alongside zoologist.When: Weekdays (9 AM - 1 PM).Transportation: Provided.What to Expect: Assist in exciting activities, support the zoo team, and make a positive impact!Sign up nowand be part of this wild experience!For questions please email NYUAD Civic Engagement & Service at nyuad.civic.engagement@nyu.edu",
        "topic": "Community Outreach",
        "date": "2025-01-21",
        "posted_by": "Shamma Albreiki"
    },
    {
        "title": "Spring/Summer Grads: Deadline to finalize major/minor declarations is January 27th",
        "category": "Deadlines",
        "description": "Graduating soon! Congratulations!To ensure that you are on track with degree requirements check your Degree Progress Report (DPR) for declaredmajors and minors.If any changes need to be made, submit adeclarationform no later than the last day of add/drop in the lastsemesteryou plan to graduate.For students graduating in thespring semester or summer/June term, the deadline to update any declarations is thelast day of 14-week add/drop for thespring semester.For students graduating in thefall semester or January term, the deadline to update any declarations is thelast day of 14-week add/drop for thefall semester.If you have any questions about your majors or minors please reach out to your mentor or visit theAcademic Resource Center(nyuad.arc@nyu.edu).Have a great semester at NYU Abu Dhabi!",
        "topic": "Registrar",
        "date": "2025-01-17",
        "posted_by": "Monique Hassan"
    },
    {
        "title": "All are invited to participate in MRI research!",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "ASPIRE Precision Medicine Research Institute Abu Dhabi invites you to participate in a MRI study here at NYUAD. The institute’s mission is to gain a better understanding of conditions prevalent in the region.For the first session, we will first collect demographic data and vision tests. Then, we will collect a series of brain scans in the MRI scanner. Finally, we will collect a saliva sample. This will take approximately 2 hours to complete. The second session will consist of a 1 hour OCT scan and VR vision tests. You will be compensated with vouchers worth approximately 180 AED for full participation.You are eligible to participate if you are above 18 years of age, do not have a history of neurological conditions, and are not pregnant at the time of the study. Those with non-removable metal in their body cannot participate.If you are interested please email the researchers below with the subject line “MRI study.”Last names A-M contact Aysha Hamkari:aah698@nyu.eduLast names N-Z contact Dana Alkalali:dna8993@nyu.edu",
        "topic": "Research",
        "date": "2025-01-16",
        "posted_by": "Dana Nayef Omar Mohamed Alkalali"
    },
    {
        "title": "Join Us for Friday Meal Distribution with Emirates Red Crescent!",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "We’re thrilled to announce an incredible opportunity to make a meaningful impact by distributing meals to those in need. Join us every Friday morning from 10:00 AM to 1:00 PM in Mussafah, in front of the Emirates Red Crescent Warehouse, as we work together to support our community.Event Details:Location: Mussafah, in front of ERC WarehouseTiming: Fridays, 10:00 AM – 1:00 PM (before Friday prayers)Transportation: Provided for all participantsRegister here!Be a part of this rewarding experience, and let’s make a difference together! For any questions, please reach out to NYUAD Civic Engagement & Service at nyuad.civic.engagement@nyu.edu.Starts on January 24, 2025!",
        "topic": "Community Outreach",
        "date": "2025-01-16",
        "posted_by": "Shamma Albreiki"
    },
    {
        "title": "Exciting Announcement: Rabt Hub Program is Here!",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "We’re thrilled to announce the launch ofRabt Hub, an inspiring initiative by NYUAD in collaboration with the Emirates Foundation and the Emirates Council for Rural Development. Rabt Hub aims to empower young women aged 18–35 by enhancing their English language skills for practical, everyday use and personal development.Be part of this impactful journey!As a tutor, you’ll play a key role in helping participants achieve their goals, while gaining valuable experience in mentorship and cross-cultural exchange.Interested in joining? Register now![Registration Link]For any inquiries, please email nyuad.civic.engagement@nyu.edu.Let’s make a difference together!",
        "topic": "Community Outreach",
        "date": "2025-01-16",
        "posted_by": "Shamma Albreiki"
    },
    {
        "title": "Library Hours update_Spring 2025 (starting Jan 20)",
        "category": "Service Notifications",
        "description": "Monday - Thursday : 8:00 am - 2:00 amFriday : 8:00 am - 10:00 pmSaturday : 10:00 am - 8:00 pmSunday : 10:00 am - 2:00 am",
        "topic": "Library",
        "date": "2025-01-15",
        "posted_by": "Gerardo Reyes Jr."
    },
    {
        "title": "OSHE Policy",
        "category": "Policies",
        "description": "NYUAD's Occupational Safety and Health Policy has been reviewed and updated recently. Please take a moment to view the updated policyhere.",
        "topic": "Environmental Health and Safety",
        "date": "2025-01-14",
        "posted_by": "Meenakshi Gupta"
    }
]