[
    {
        "title": "Study Away Course Alternate Proposals",
        "category": "News & Information",
        "description": "If you submitted a proposal that is pending a final decision, please be sure to have a backup enrollment plan in place in case the course is not approved as proposed or a decision is not made before the end of add/drop.Although every effort is made to review courses timely, the review process can take several weeks. You will be notified by email when a decision is made.Proposals should be submitted at least three weeks before the start ofregistrationto allow time for schedule adjustments and/or further proposals.Course alternates are reviewed and updated regularly. Please check frequently as you plan your study away.",
        "topic": "Registrar",
        "date": "2025-01-24",
        "posted_by": "Monique Hassan"
    },
    {
        "title": "Language Matters Speaker Series on Translanguaging",
        "category": "Events & Activities",
        "description": "Join us for the first webinar this semester on language pedagogy on Monday, Feb. 24, at 5pm via Zoom.\"Beyond Boundaries: Pedagogical Translanguaging and the Transformation of Language Learning\" by Dr. Mihi Park, NUS SingaporeMany language classrooms have become vibrant spaces of linguistic diversity, presenting opportunities and challenges to traditional language instruction. Recognising this potential, language instructors are reimagining course design through the lens of pedagogical translanguaging. In this webinar, I will share a compelling narrative of how translanguaging can create meaningful bridges between existing and new knowledge. This approach encourages students to view language not as a rigid system, but as a fluid, interconnected resource.Register at https://bit.ly/nyuad-lmss",
        "topic": "Academics",
        "date": "2025-01-24",
        "posted_by": "Eduardo LageOtero"
    },
    {
        "title": "Tandon Summer Research Program",
        "category": "News & Information",
        "description": "Excited about hands-on research? The NYU Tandon Undergraduate Summer Research Program (UGSRP) is your chance to dive into 10 weeks of cutting-edge research with world-class faculty! The program is open to NYUAD students studying at any NYU US-based site for spring 2025.Key Dates:2025 Program Dates: June 2 – August 8, 2025Application Deadline: Sunday, February 9, 2025 (11:59 PM EST)How to Apply:Explore the 2025 Project List and submit your application through theUGSRP Online Application Portal!",
        "topic": "Academics",
        "date": "2025-01-24",
        "posted_by": "Farhana Goha"
    },
    {
        "title": "Peer Tutoring at the ARC",
        "category": "News & Information",
        "description": "Our peer tutoring services will resume onJanuary 27th.We offer drop-ins for the following:Math:drop-in scheduleEngineering:drop-in scheduleComputer Science:drop-in scheduleWe offer appointments for the following:Foundations of ScienceSocial ScienceMathYou can view our tutoring services and schedule appointments throughNYUConnect.If you have any questions or inquires, please email us:nyuad.arc@nyu.eduWe look forward to supporting you!",
        "topic": "Academic Resources",
        "date": "2025-01-24",
        "posted_by": "Amna Mohamed Saeed Alfarraj Alketbi"
    },
    {
        "title": "Prehealth Advising: Committee Letter Process",
        "category": "Learning & Development",
        "description": "If you’rea juniorapplying to US medical schools this cycle, please completeCommittee Letter Part 1 Applicationto register your interest in applying.All juniors who have not yet met with the Pre-Health Advisor should do so to discuss their goals.You can book an appointment hereby selectingNYUAD Health and Medicine Career Advising appointment type.What is a Committee Letter?A committee letter is a comprehensive evaluation of your qualifications for medical school written by the prehealth advising team. It consolidates feedback from faculty, mentors, and other recommenders into a single document submitted to medical schools through theAmerican Medical College Application Service (AMCAS).Learn more in the AAMC Guide on Applying to Medical School.Don't miss any Pre-med-related updates!Be sure to join the community and not miss any useful information, events, and more by joining theNYUAD Health and Medicine Career CommunityHERE",
        "topic": "Career Development",
        "date": "2025-01-24",
        "posted_by": "Manal Deria"
    },
    {
        "title": "Pest Treatment - D2 Restaurant",
        "category": "News & Information",
        "description": "Hi All,We would like to inform you that, as part of our mandatory preventive measures we will be conducting a Pest treatment inCampus East Restaurant (D2)onFriday, 31st January 2025. Saying this all our dining services including the delivery services willclose by 9 pmand we will resume all our services the following day as per regular dining operating hours.",
        "topic": "Dining",
        "date": "2025-01-24",
        "posted_by": "Joselyn Jusayan Ilumin"
    },
    {
        "title": "CGSB XIII Symposium February 19-21, 2025",
        "category": "Events & Activities",
        "description": "The Center for Genomics and Systems Biology, in collaboration with NYUAD Institute, will host the thirteenth annual Genomics and Systems Biology Symposium on February 19-21, 2025.Discover how AI and machine learning tools transform the ability to analyze large datasets, uncovering hidden patterns in basic and clinical research. With genomic research projected to generate up to four exabytes of data in the next decade, AI is becoming essential. Join CGSB XIII and explore its applications in biomedicine and functional and evolutionary genomics.Registration is now openhere.",
        "topic": "Research",
        "date": "2025-01-24",
        "posted_by": "Susan Havlis"
    },
    {
        "title": "Audition call for Exhibition at Warehouse421",
        "category": "Events & Activities",
        "description": "421 Arts Campus is looking for actors and performers to be a part of \"Abdullah Al Saadi: Sitesof Memory, Sites of Amnesia,\" curated by Tarek Abou El Fetouh.This exhibition in Abu Dhabi will expand on the work initially presented in the UAE National Pavilion at the Venice Biennial in 2024. We are looking for actors and performers fromAbu Dhabi to be part of the exhibition’s performance action!Exhibition dates:January 30 to May 4, 2025Performances will take place on the weekends in421 Arts Campus, Abu Dhabi.Auditions dates:Sunday, January 26, 2025At 421 Arts Campus, Studio 4To sign up for a slot, please do sohere.If you are not able to find an appointment slot, please contact: hello@421.online",
        "topic": "Student Activities",
        "date": "2025-01-24",
        "posted_by": "Layla Alsawan"
    },
    {
        "title": "Student Assistantship Opportunity",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "Are you looking for a meaningful way to contribute to the NYUAD community?The Student Persistence and Accessibility Team is seeking note-takers for the following courses:1. Data Structure (CS-UH 1050)2. Communications Lab (IM-UH 1011)3. Discrete Mathematics (CS-UH 1002)4. Mathematics for Statistics & Calculus (Math-UH 1000AQ & BQ)If you’re currently enrolled in two of these classes, we’d love for you to apply! Becoming a note-taker is a fantastic opportunity to support your peers while enhancing your own academic skills.Apply now throughHandshakenow!",
        "topic": "Campus Life",
        "date": "2025-01-24",
        "posted_by": "Zainab Alhassan"
    },
    {
        "title": "Commencement portrait bookings now open!",
        "category": "News & Information",
        "description": "Class of 2025 students can now book an appointment for their Commencement portrait.Please refer to the email sent byClass Year Experience on January 20 to access the appointment link. Portrait sessions are taking place on the following dates:Week 1 - February 4, 5, 6, 7Week 2 - February 10, 11, 12, 13Week 3 - February 17, 18, 19, 20Book your appointment in advance.There are a lot of slots available for week 1 and 2 so we encourage you to book your appointments for those days.",
        "topic": "Communications",
        "date": "2025-01-24",
        "posted_by": "Deepthi Unnikrishnan"
    },
    {
        "title": "Want to participate in brain research?",
        "category": "Job Opportunities, Internships & Volunteering",
        "description": "ASPIRE Precision Medicine Research Institute Abu Dhabi invites you to participate in a MRI study here at NYUAD! The institute’s mission is to gain a better understanding of conditions prevalent in the region.For the first session, we will first collect demographic data and vision tests. Then, we will collect a series of brain scans in the MRI scanner. Finally, we will collect a saliva sample. The study will take approximately 2 hours to complete. The second session will consist of a 1 hour OCT scan and virtual reality vision tests. You will be compensated with vouchers worth 180 AED.You are eligible to participate if you are above 18 years of age, do not have a history of neurological conditions, are not pregnant at the time of the study, and do not have non-removable metal.If you are interested please email the researchers below with the subject line “MRI study.”Last names A-M contact Aysha Hamkari:aah698@nyu.eduLast names N-Z contact Dana Alkalali:dna8993@nyu.edu",
        "topic": "Research",
        "date": "2025-01-24",
        "posted_by": "Dana Nayef Omar Mohamed Alkalali"
    },
    {
        "title": "Free tickets to the Kayan Wellness Festival!",
        "category": "Events & Activities",
        "description": "Student Persistence and Well-being are excited to offera limited number of freeone day passesfor NYU Abu Dhabi students to attend the Kayan Wellness Festival on Al Fahid Island in Abu Dhabi from January 31st to February 2nd, 2025! This unique event focuses on mental, physical, and spiritual well-being, aligning with NYUAD’s commitment to fostering student well-being.The festival features global experts like Sadhguru, Gary Brecka, Zach Bush, Mo Gawdat, and Marisa Peer, alongside activities such as yoga, breathwork, sound healing, and fitness. Don’t miss this special opportunity to engage in holistic well-being and recharge. For more details, check out the festival program linkedhere.Ifyou would like a free one-day pass to the festival, please fill out the followingformby Tuesday, January 28th, 2025. Tickets are available on a first come first serve basis, so make sure to sign up ASAP!Regards,Student Persistence and Well-being",
        "topic": "Wellness",
        "date": "2025-01-24",
        "posted_by": "Yenushka Karunaratne"
    },
    {
        "title": "Maintenance on NYU Wifi",
        "category": "Service Notifications",
        "description": "IT will be conducting scheduled maintenance on the NYU Wifi network on Thursday, January 23rd, from 8 PM to 11 PM. During this period, there will be no impact on the Wifi; however, Apple Mac users may need to accept a certificate when connecting to the NYU Wifi. For more details, please visit thislink.If you have any concerns or questions, please contact the IT Servicedesk on x88888 or emailnyuad.it@nyu.edu.",
        "topic": "Technology",
        "date": "2025-01-24",
        "posted_by": "Aman Mudhar"
    },
    {
        "title": "Philosophy Colloquium: \"Take In Your Hen: Fittingness and Hedonic Adaptation\"",
        "category": "Events & Activities",
        "description": "WHO:Alex Gregory(University of Southampton)WHAT:Philosophy Colloquium: \"Take In Your Hen: Fittingness and Hedonic Adaptation\" (abstract)WHERE: A6 (Humanities) 1159WHEN:Friday 31 January, 10:00–11:30amWHY: Now you're doing philosophy!Coffee and snacks will be served.The colloquium is open to all NYUAD faculty, students, and staff.",
        "topic": "Academics",
        "date": "2025-01-24",
        "posted_by": "Matthew Silverstein"
    },
    {
        "title": "Computer Science & CITIES Seminar",
        "category": "Events & Activities",
        "description": "Computer Science & CITIES SeminarDescription:view in calendarSpeaker:Prof. Peter Haas, UMass Amherst, USATitle:Graph and Generative Neural Networks for Accelerating Simulation-based Decision Making Under UncertaintyHost:CITIES (Azza Abouzied, Associate Professor of Computer Science)Location:C1-045Time:2:15 - 3:15 pmDate:Tuesday, February 11, 2025RSVPhere.",
        "topic": "Academics",
        "date": "2025-01-24",
        "posted_by": "Adela Kovarova"
    }
]